{"date":"2023-03-13T11:26:25.181Z","jobs":[{"title":"EL1 Solution Architect - Finance Domain, Melbourne, Sydney, Brisbane","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=51fd5ae587a16510ca450e170cbb35a7&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nEL1 Solution Architect - Finance Domain, Melbourne, Sydney, Brisbane ID: DM-17956\nNational Disability Insurance Agency\nClosing: 28 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17956"},{"label":"RFQ published date","value":"Monday, 13 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 24 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 28 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"National Disability Insurance Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<h3>Mandatory Requirement</h3><p>As part of the eligibility and suitability requirement, NDIA seeks specified personnel who are Australian citizens.</p><p>Applicable for ACT, VIC and QLD: Labour hire licences are required in the state that specified personnel are being contracted.</p><p><br></p><p>The request seeks to engage experienced sellers who have capability to provide a Solution Architect who will be responsible for the ongoing development of systems architecture blueprints for projects across finance domain, with specific focus on delivery of the service enhancement and digital transformation objectives.</p><p><br></p><p><strong>Duties</strong></p><p><br></p><ul><li>Deliver high quality solution architectures that are fit for business purpose</li><li>Align solutions with Agency goals and objectives and Enterprise Architecture reference models, principles, policies, standards and roadmaps</li><li>Liaise with the finance team and key solution stakeholders to ensure expected business outcomes are achieved</li><li>Maintain technical oversight and helps solve complex issues arising during project delivery</li><li>Facilitate technical decision making</li><li>Present the project solution at approval at the appropriate Governance Councils</li></ul><p><br></p><p><br></p><p>Entry Level checks will be required for all successful candidates and dependent on the role the appropriate working with children and/or vulnerable people checks may need to be undertaken as per State Legislation.</p>","data":[{"label":"Estimated start date","value":"Monday, 24 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"NSW, QLD, VIC"},{"label":"Working arrangements","value":"Subject to negotiations with line manager, hybrid working arrangements in line with current NDIS policy are available (minimum of 3 days each week in the office, with flexible arrangements in place for the remaining 2 days). Please refer to draft work order detailing changes to Clauses 27 & 28"},{"label":"Security clearance","value":"Other - Pre-engagement Checks will be undertaken by NDIA and commencement is subject to the Specified Personnel meeting the standard in relation to the Pre-Engagement Check requirements. The Contractor must comply with and ensure ongoing compliance with the Pre-Engagement Checks. NDIA seeks specified personnel who are Australian citizens."},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Bachelor of Science/Business in Information Technology or equivalent tertiary qualification is mandatory"},{"desc":"Excellent listening, communication and stakeholder management skills"},{"desc":"Broad technical & architectural background delivering solution architectures for projects; experience balancing project and program, project and organisational goals, as well as tactical and strategic drivers"},{"desc":"Experience working on finance projects, including working with payments systems, transformation teams, UX/CX designers, and assistant technology enabled (Accessibility Compliant) applications"},{"desc":"Familiar with deployment in public and private government approved cloud and associated security considerations; experience working in both Agile and Structured delivery environments"},{"desc":"Having detailed understanding of digital, mobile and web architectures that leverage API’s, microservices, and stateless token-based authentication and authorization"}],"desirable":[{"desc":"Experience leading finance transformation programs and payments systems"},{"desc":"TOGAF certified or equivalent IT architectural qualification"},{"desc":"Azure or AWS cloud architectural certifications"},{"desc":"Experience in UML & exposure to SalesForce"}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"APS6 Senior Salesforce Administrator - Canberra, Melbourne or Sydney","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=8d2a74a187ad2510ca450e170cbb351b&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nAPS6 Senior Salesforce Administrator - Canberra, Melbourne or Sydney ID: DM-17955\nNational Disability Insurance Agency\nClosing: 24 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17955"},{"label":"RFQ published date","value":"Monday, 13 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 24 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"National Disability Insurance Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<h3>Mandatory Requirement</h3><p>As part of the eligibility and suitability requirement, NDIA seeks specified personnel who are Australian citizens.</p><p>Applicable for ACT, VIC and QLD: Labour hire licences are required in the state that specified personnel are being contracted.</p><p><br></p><p>The request seeks to engage experienced sellers who have capability to provide an experienced and energetic Salesforce Administrator to join our dynamic fast-paced team.</p><p><br></p><p>About the Project:</p><p>The NDIA is committed to providing access to its services for Participants and Providers through digital and cloud channels.&nbsp; We are undertaking a major program of work involving multiple projects spanning a number of current industry-leading technologies, including Salesforce/Industries as a core component.</p><p><br></p><p>Duties</p><ul><li>Maintain and configure Service Cloud, Health Cloud and Digital Experience applications</li><li>Exhibit a deep understanding of the Salesforce platform, with the ability to build end-to-end automated processes using declarative tools</li><li>Investigate and troubleshoot OmniStudio components including FlexCards, Omniscripts, data raptors and integration procedures</li><li>Perform ongoing system administration including maintaining users, monitoring application metrics, managing salesforce configurations and data integrity</li><li>Deployment of changes via existing DevOps framework</li><li>Perform interrogation of various log sources to investigate issues</li><li>Evaluate new releases of Salesforce to determine functionality requirements and provide detailed information on how changes will apply to all affected departments/users</li><li>Develop and maintain documentation on processes and configuration</li><li>Liaise with internal and external stakeholders across various disciplines (business, architecture, data etc.)</li><li>Work within an Agile delivery methodology</li><li>Troubleshooting API and integration issues with different applications e.g. MuleSoft.</li><li>Development of meaningful event monitoring and alerting</li><li>Knowledge transfer and training within the team</li></ul>","data":[{"label":"Estimated start date","value":"Monday, 24 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, VIC"},{"label":"Working arrangements","value":"Subject to negotiations with line manager, hybrid working arrangements in line with current NDIS policy are available (minimum of 3 days each week in the office, with flexible arrangements in place for the remaining 2 days"},{"label":"Security clearance","value":"Must be able to obtain Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"More than 5 years’ experience within Salesforce eco-system"},{"desc":"Experience/Exposure with Salesforce Industries including OmniStudio"},{"desc":"Exposure to OOPs and Apex (Triggers, Controller, Classes) for debugging and managing minor enhancements"},{"desc":"Hands on experience with version control, branching and metadata deployments"},{"desc":"Certified Salesforce Admin ADM201 or ADM211 & Platform App Builder"}],"desirable":[{"desc":"Demonstrable experience providing technical support for Experience Cloud"},{"desc":"Exposure to HTML, CSS and JavaScript is added advantage"},{"desc":"Platform Developer 1 Certification or Vlocity Certification will be a standout"}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Standard Operating Environment (SOE) Integration Engineer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=4cd84b288769e110573d450a0cbb3519&entry=opp_page","type":"Open to all","innerText":"Open to all\nStandard Operating Environment (SOE) Integration Engineer ID: DM-17954\nDepartment of Defence\nClosing: 14 April 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17954"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Wednesday, 12 April 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 14 April 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Commonwealth seeks to engage an Advanced Practitioner as the Standard Operating Environment (SOE) Integration Engineer. This proposal seeks to engage an Engineering and Technical Services Advanced Practitioner to assist with the design, development, build and support of LNIC led ICT capabilities used within both fixed and deployed systems. &nbsp;This RFQTS is for an established vacant position within the Land Network Integration Centre (LNIC).</p><p>The position is primarily a technical hands-on role, with responsibility to conduct capability development, as well as design, build, maintenance and configuration control tasks. This is inclusive of capability development and configuration control tasks of software integration and SOE deployment design (including scripting, build automation, application packaging). This position requires a combination of disciplines including technical hands-on communications engineering, innovation, test and evaluation, and documentation.</p><p>As a technical subject matter expert within a small team the candidate will also be expected to contribute to the design of LNIC led deployable solutions, data centre and/or network integration solutions, as well as review project design documentation and provide advice on integration across Land Combat System (LCS) interfaces.</p><p>It is expected that the majority of services delivered under this contract will be at the LNIC facility in Symonston, ACT. Interstate travel, and possibly international travel, will be required to support TCN trials, liaison with LNBL stakeholders and the support of other ADF field activities. These events will be forecasted by LNIC, booked by the vendor and reimbursed by the Commonwealth.</p><p>A three (3) month period of probation is imposed as a condition of engagement for all new contractors.</p>","data":[{"label":"Estimated start date","value":"Monday, 22 May 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"It is expected that the majority of services delivered under this contract will be at the LNIC facility in Symonston, ACT. Interstate travel, and possibly international travel, will be required to support TCN trials, liaison with LNBL stakeholders and the support of other ADF field activities. These events will be forecasted by LNIC, booked by the vendor and reimbursed by the Commonwealth."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Qualifications, and practical experience in the skills described previously and extensive (greater than 10 years) relevant experience; preferably within Government Local Area Networks within the deployable Defence domain."},{"desc":"Exposure or experience working with deployed networks and exposure with network integration at the tactical and operational levels within the ADF, including interfaces to strategic network boundaries."},{"desc":"Experience applying security best practises in compliance with the Information Security Manual (ISM)."}],"desirable":[{"desc":"The ability to integrate into a high functioning team and to manage their own time and priorities effectively."}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Defence Mission Engineering Support","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=c645f22c1baded10072a98eb274bcbb8&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nDefence Mission Engineering Support ID: DM-17949\nDepartment of Defence\nClosing: 19 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17949"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 19 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The successful tenderers will be expected to provide support services to enable establishment of mission engineering in VCDF Group and Defence more broadly. The required services are as follows:</p><ol><li>Translate strategic guidance and intelligence into accurate characterisations of missions (mission threads) which reflect assessed context, Defence policies, doctrine and concepts.</li><li>Support implementation of mission solutions in collaboration with Capability Managers (CMs) and Delivery Groups (mission engineering threads).</li><li>Application of contemporary analytical methods (trade-off analysis, modelling, mission metrics development).</li><li>Contribute to the evolution of the mission engineering process into a mature Defence process, integral to force design and capability development.</li><li>Support capture and configuration management of mission engineering architecture and detailed design content in a model-based environment.<br></li></ol><p>The contracting approach is based on the following:</p><ol><li>Defence requires the provision of up to five full-time and appropriately qualified Key Persons to deliver the services based on ‘Time and Materials’ (T&amp;M) which will be directed and performed under the supervision of an ADF member.</li><li>The selected candidates can be drawn from different providers.</li><li>The selected candidates will be expected to work from Defence facilities in Canberra.</li><li>The contract period is based on an initial contract to end June 2023 followed by the options for two subsequent one year extensions.</li><li>The initial requirement is currently for up to five individuals however a merit pool of suitable candidates will be established for additional engagement if required.</li></ol>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"5 days per week."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"6"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"EC-1: A minimum of 15 years’ experience relevant to the following: (1) application of ADF doctrine and military operational planning (essential) (2) demonstrated understanding of Defence strategic and policy context (essential) (3) involvement in capability development processes including systems engineering (highly desirable)."},{"desc":"EC-2: Demonstrated ability to undertake analysis, apply critical thinking, and innovate on matters related to military and capability planning."},{"desc":"EC-3: Additional experience (beyond EC-1) and qualifications of the Key Persons offered to provide the Services."},{"desc":"EC-4: Costing estimates and pricing structure."},{"desc":"EC-5: Completeness of response and attention to detail."}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Defence Mission Engineering Support","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=6698166c1b2ded10072a98eb274bcb08&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nDefence Mission Engineering Support ID: DM-17946\nDepartment of Defence\nClosing: 19 March 2023, 11:59PM Canberra time\nCategory: Strategy and Policy(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17946"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 19 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The successful tenderers will be expected to provide support services to enable establishment of mission engineering in VCDF Group and Defence more broadly. The required services are as follows:</p><ol><li>Translate strategic guidance and intelligence into accurate characterisations of missions (mission threads) which reflect assessed context, Defence policies, doctrine and concepts.</li><li>Support implementation of mission solutions in collaboration with Capability Managers (CMs) and Delivery Groups (mission engineering threads).</li><li>Application of contemporary analytical methods (trade-off analysis, modelling, mission metrics development).</li><li>Contribute to the evolution of the mission engineering process into a mature Defence process, integral to force design and capability development.</li><li>Support capture and configuration management of mission engineering architecture and detailed design content in a model-based environment.<br></li></ol><p>The contracting approach is based on the following:</p><ol><li>Defence requires the provision of up to five full-time and appropriately qualified Key Persons to deliver the services based on ‘Time and Materials’ (T&amp;M) which will be directed and performed under the supervision of an ADF member.</li><li>The selected candidates can be drawn from different providers.</li><li>The selected candidates will be expected to work from Defence facilities in Canberra.</li><li>The contract period is based on an initial contract to end June 2023 followed by the options for two subsequent one year extensions.</li><li>The initial requirement is currently for up to five individuals however a merit pool of suitable candidates will be established for additional engagement if required.<br></li></ol>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"EC-2: Demonstrated ability to undertake analysis, apply critical thinking, and innovate on matters related to military and capability planning."},{"desc":"EC-1: A minimum of 15 years’ experience relevant to the following: (1) application of ADF doctrine and military operational planning (essential) (2) demonstrated understanding of Defence strategic and policy context (essential) (3) involvement in capability development processes including systems engineering (highly desirable)."},{"desc":"EC-3: Additional experience (beyond EC-1) and qualifications of the Key Persons offered to provide the Services."},{"desc":"EC-4: Costing estimates and pricing structure."},{"desc":"EC-5: Completeness of response and attention to detail."},{"desc":"EC-6: Current security clearance level no less than NV1."}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references","interview"]}},{"title":"IRAP Assessment preparation - FAM","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=0b62dae087e56110f1afc9150cbb3593&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nIRAP Assessment preparation - FAM ID: DM-17945\nAustralian Institute of Health and Welfare\nClosing: 21 March 2023, 11:59PM Canberra time\nCategory: Cyber Security\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17945"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Australian Institute of Health and Welfare"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Under the Future Analytics Model (FAM), AIHW are building a new cloud-based data analytics environment to support several use cases. The environment is being built in our Microsoft Azure tenancy and leverages Databricks for the analytic capability. It is intended that this environment goes through an IRAP assessment.</p><p>The purpose of this RFQ is to source a vendor to assist in the preparation of the environment for an IRAP assessment including creating/updating security documentation and ensuring the system has implemented appropriate security controls.</p>","data":[{"label":"Estimated start date","value":"Friday, 07 April 2023"},{"label":"Initial contract duration","value":"3 Months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The vendor’s consultants should have demonstrated experience in performing risk assessments and developing security documentation within an Australian federal government context."},{"desc":"The vendor must have availability to complete the work in the specified timeframes."}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references"]}},{"title":"Microsoft Defender 365 Managed Detection and Response","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=d23d86ec8765e110573d450a0cbb3511&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nMicrosoft Defender 365 Managed Detection and Response ID: DM-17944\nDepartment of Finance\nClosing: 24 March 2023, 11:59PM Canberra time\nCategory: Cyber Security\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17944"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Wednesday, 22 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 24 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Finance"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Refer to attachment</p>","data":[{"label":"Estimated start date","value":"Sunday, 24 December 2023"},{"label":"Initial contract duration","value":"36 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"3"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Refer to RFQ 'Statement of Requirements' regarding deliverables for essential criteria.","weight":"100 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","references"]}},{"title":"ICT Cost Model and ICT and Digital Strategies","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=6b8ce1a087a9e1505b220ed90cbb35bf&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nICT Cost Model and ICT and Digital Strategies ID: DM-17938\nComcare\nClosing: 26 March 2023, 11:59PM Canberra time\nCategory: Change and Transformation(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17938"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 26 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Comcare"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Comcare is seeking to develop its future Information and Communications Technology (ICT) Strategy as well as several other key artefacts which directly influence the development of its future ICT environment. Comcare’s current ICT Strategy has been written for the duration of 2019–2023 and is time for a refresh. The current ICT Strategy consists of six workstreams focusing on modernising ICT and the information management processes. Each workstream contributed to delivering key capabilities aligned with Comcare’s current challenges and future priorities including:</p><ul><li><strong>Stakeholder management</strong>— Developing a single view of customer allowing Comcare to better understand its customers and provide better services across the customer base</li><li><strong>Digital services </strong>- Providing a self-service experience so stakeholders can interact with Comcare effectively.</li><li><strong>Enabled workforce—</strong>Using contemporary tools such as robotics, automation and streamlined processes</li><li><strong>Knowledge—</strong> Maximise the value of Comcare’s information by facilitating the knowledge lifecycle</li><li><strong>Platform—</strong> Deliver an agile, adaptive business platform to support Comcare in a dynamic environment without complex ICT infrastructure</li><li><strong>Cyber security—</strong> Ensure Comcare information is appropriately secured against malicious actors</li></ul><p>The new ICT Strategy must continue to establish the key ICT platforms and capabilities that will promote innovation, deliver insight, and underpin comprehensive customer-centric services. In addition to this, the new strategies must address Comcare’s highlighted interest in focusing on emerging technologies in the workforce along with increased data expectations, new opportunities for data sharing, current increase in cyber security and investing in technology to maintain a flexible and agile workforce.&nbsp;<br></p>","data":[{"label":"Estimated start date","value":"Monday, 01 May 2023"},{"label":"Initial contract duration","value":"8 months - 1st May 2023 to 22 December 2023"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, QLD, VIC, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The extent to which the Tenderer has the capability to provide the services as described in the Statement of Requirement","weight":"60 %"},{"desc":"The extent to which the Tenderer has the capacity to provide the services as described in the Statement of Requirement","weight":"40 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","response template"]}},{"title":"Provision of financial systems manager for ad hoc support","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=3f2279601b652150472c1f8c274bcb87&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nProvision of financial systems manager for ad hoc support ID: DM-17940\nNational Archives of Australia\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17940"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"National Archives of Australia"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The NAA is looking to procure a financial systems manager to provide ad hoc support for our costing model.<br><br>The end date of the contract will be 30 June 2023 with no extension options.<br><br><br></p>","data":[{"label":"Estimated start date","value":"Thursday, 16 March 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The work is on an ad hoc basis, providing support when requested by the buyer."},{"label":"Security clearance","value":"Must have Baseline"},{"label":"Maximum number of candidates per seller","value":"1"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"The specialist must have the availability to provide support when requested."},{"desc":"The specialist must be familiar with costing models and have demonstrated capability to provide ongoing support on the costing model."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés"]}},{"title":"User Researchers (x3)","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=b7a406a887e5a110ca450e170cbb355a&entry=opp_page","type":"Open to all","innerText":"Open to all\nUser Researchers (x3) ID: DM-17943\nDigital Transformation Agency\nClosing: 20 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17943"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Digital Transformation Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Digital Transformation Agency is hiring User Researchers for its Digital Sourcing branch to help build a better BuyICT.gov.au and marketplace experience.</p><p>The User Researchers will collaborate with other researchers to conduct studies that help understand user needs, behaviours, and preferences to inform product and service design and development.</p><p>Candidates should hold qualifications in a relevant field or equivalent experience, 4+ years of experience conducting user research, strong analytical skills, and a passion for user-centred design.</p><p>Key responsibilities include planning and conducting user research studies using appropriate methods, analysing research data, collaborating with stakeholders and helping to create and maintain a user-centred design process.</p><p>Understanding of government procurement practices and working in an Agile team is helpful but not essential.</p>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"12 Months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT, NSW, Offsite"},{"label":"Working arrangements","value":"Will be determined based on Candidates location"},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Tell us about a time when you have planned, designed, and conducted user research studies, including interviews, surveys, and/or ethnographic research"},{"desc":"Tell us about a time when you have analysed research data and reported findings to the product team and stakeholders to inform decisions"},{"desc":"Tell us about a time when you have collaborated with stakeholders to inform the design and development of a government digital product or service"}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","interview"]}},{"title":"EAP Program Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=9c03c6ac87e9e1505b220ed90cbb35a4&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nEAP Program Manager ID: DM-17942\nCivil Aviation Safety Authority\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17942"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Civil Aviation Safety Authority"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p><strong>Summary </strong></p>\n<p>Reporting to the Branch Manager of Transformation and Project Director the candidate must undertake the following tasks:</p>\n<ol><li>Define, plan and direct program/scope throughout life cycle, direct scope change activities and direct program/project stage gates.</li><li>Engage and manage a blended team of Business teams, CASA staff and contractors from Information Technology Branch (ITB).</li><li>Work effectively and with influence with key business enabling functions to achieve outcomes for the business.</li><li>Management of resources, budgets and associated activities to support project activities and deliverables.</li><li>Develop project plans and provide detailed status reports on progress and budget;</li><li>Work co-operatively and collaboratively with the (ITB) team, as well as other stakeholders within CASA.</li><li>Identify program/project quality requirements, conduct quality assurance and manage the quality management process.</li><li>Assist in the design and Implementation of risk management strategies in relation to change activities.</li><li>Stakeholder, change and communication management.</li><li>Other related tasks as requested by the Project Director and Branch Manager Transformation.</li></ol>\n<p><strong>Mandatory</strong></p>\n<ol><li>Ten or more years of demonstrated Project management experience in business led projects, with complex multi-faceted deliverables across business.</li><li>Demonstrated experience in stakeholder and change management.</li><li>Highly developed communication (oral and written) skills with the ability to clearly articulate information to influence a wide variety of stakeholders and subject matter experts.</li><li>Strong project governance experience, including ability to use tools such as Microsoft Project, with evidence of practical application.</li><li>Demonstrated experience in managing diverse and blended teams.</li><li>Experience working in or demonstrated understanding of complex regulatory environments, and ability to learn quickly the underpinning legislative framework(s)</li><li>Experience with one or more project/program management methodologies (such as PRINCE2, Agile, Scrum and MSP [managing successful programs]).</li><li>Effective influencing and negotiation experience and skills in an environment with high competition for resources.</li><li>Excellent analytical and execution skills.</li></ol>\n<p>&nbsp;</p>\n<p><strong>Location </strong></p>\n<p>Based in Aviation House, Phillip, ACT the Resource must work (on average) 8 hours per day (40 hours per week) between the core hours of 8.00am and 5.00pm Monday to Friday.</p>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"from Contract Commencement date until 30 June 2023"},{"label":"Extension term","value":"Other"},{"label":"Extension term details","value":"Two (2) x 12 months or parts thereof"},{"label":"Number of extensions","value":"Buyer has not provided these details"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The Resource must work (on average) 8 hours per day (40 hours per week) between the core hours of 8.00am and 5.00pm Monday to Friday."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated capability of the candidate to satisfy the specification of the requirements"},{"desc":"Demonstrated experience of the candidate in the delivery of the services required"},{"desc":"A guaranteed and competitive pricing structure that incorporates all known fixed charges/taxes etc."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","interview"]}},{"title":"Professional Services to Resolve Microsoft Teams and OneDrive Issues","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=dfb8b12087e9e1505b220ed90cbb3542&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nProfessional Services to Resolve Microsoft Teams and OneDrive Issues ID: DM-17941\nNational Archives of Australia\nClosing: 14 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17941"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"National Archives of Australia"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>National Archives of Australia is seeking a quote for named personnel with a minimum of Negative Vetting 1 clearance, with skills and experience with Microsoft Teams and OneDrive implementations.</p><p>NAA has an immediate need to onboard a specialist for a two week engagement, to be embedded within its ICT Service Desk.&nbsp; The specified personnel will troubleshoot and resolve a series of issues related to MS Teams, specifically issues with joining meetings and making phone calls.&nbsp; They will also troubleshoot and resolve issues related to OneDrive.</p><p>The preferred candidate will have a strong background in these M365 capabilities.</p><p>NAA is seeking a daily rate, inclusive of GST.</p><p>The contract period will be through until 30 June 2023, with two x 3 month option periods.&nbsp; This will allow NAA to reengage with the seller and onboard named personnel to provide ad hoc support if M365 problems emerge.</p><p><br></p>","data":[{"label":"Estimated start date","value":"Friday, 17 March 2023"},{"label":"Initial contract duration","value":"Until 30 June 2023"},{"label":"Extension term","value":"3 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"NAA need the specified personnel to be onsite at its ACT Mitchell office, Monday to Friday during business hours to be embedded within the ICT Service Desk. After hours work may be required on occasion where a change request is to be implemented after business hours."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"4"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Strong understanding of NAA implementation of Microsoft Teams, with the skills and experience required to troubleshoot and resolve issues experienced by end users."},{"desc":"Strong understanding of NAA implementation of Microsoft OneDrive, with the skills and experience required to troubleshoot and resolve issues experienced by end users."}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés"]}},{"title":"Organisational Designer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=3165fd9c1be9ad103fa942ebdc4bcb21&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nOrganisational Designer ID: DM-17936\nDepartment of Climate Change, Energy, the Environment and Water\nClosing: 19 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17936"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Saturday, 18 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 19 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Climate Change, Energy, the Environment and Water"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p><strong>Please note: Specific sellers are invited to respond to this opportunity, due to the scale and scope of the procurement. The Department will not be including additional sellers to respond to this opportunity</strong></p><p><br></p><p>The Department of Climate Change Environment Energy and Water (DCCEEW) requires the services of an experienced Organisational Designer who has capability to undertake organisational design services for the purpose of capturing a target operating state for the ICT aspects of the newly formed Department. The review will capture the interim state (as at inception), target state for 30 June 2023 and a target state operating model.</p><p><br></p><p>Key deliverables:</p><p>Capture a draft current state operating model including interfaces with DAFF as the shared service provider.</p><ul><li>Capture a draft interim state (EOFY) and target state operating model, with focus on the processes within the footprint of DCCEEW IT.</li><li>Socialise the current, interim and target state operating models, with the view to baselining and achieving acceptance of these by the DCCEEW IT leadership team and Chief Information Officer.</li><li>Undertake consultation within DCCEEW IT, and to a limited extent with key personnel in DAFFs Digital Services Division to capture the current state operating model.</li><li>Liaise with key stakeholders in DCCEEW to identify opportunities to achieve an interim state operating model (EOFY) and target state operating model.</li></ul><p><br></p><p>Refer to the statement of requirements document for specific details of the RFQ.</p><p><br></p><p>Rates are not to be included in the submitted CV. Failure to adhere to this will result in the application not being compliant and therefore will not be assessed.&nbsp;</p>","data":[{"label":"Estimated start date","value":"Wednesday, 31 May 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Positions are based in our Canberra offices. Whist the department’s current Working Away from the Office (WAFO) policy encourages staff to work in the office for a minimum of 40% of the time, the team requirements are that people work in the office for a minimum of 60% of the time or 3 days a week. Variations can be discussed with the supervisor but any request for less hours in the office will need to be supported by the Director or Branch head and approved by the CIO."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated understanding of the scope of the deliverables and experience in delivering similar outcomes.","weight":"20 %"},{"desc":"Ability and description of how the required outcomes will be delivered within the timeframe.","weight":"20 %"},{"desc":"Demonstrated experience with organisational design skills and an ability to capture current state and translate this into a pragmatic target operating model for ICT.","weight":"20 %"},{"desc":"Demonstrated extensive stakeholder engagement skills: • Ability to elicit requirements from various stakeholders o Ability to effectively elicit and communicate with a broad range of stakeholders.","weight":"20 %"},{"desc":"Ability to depict the translation of current state and identification of future state in a non-technical, easily digestible format.","weight":"10 %"},{"desc":"Ability to distil a complex operating environment into fundamental processes and document these in a succinct manner.","weight":"10 %"}],"desirable":[{"desc":"Experience working within federal government and experience with change and integration, including Machinery-of-Government movements."}]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references"]}},{"title":"AGA Digital Product – GovCMS Pilot","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=5565fd1087e96110ca450e170cbb3583&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nAGA Digital Product – GovCMS Pilot ID: DM-17935\nDigital Transformation Agency\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: Agile Delivery and Governance(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17935"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Digital Transformation Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Please see attached Requirements Document.</p><p>The response is to explicitly indicate availability to support urgency to commence around:</p><ul><li>Design Phase (starting within 14 days commencing the 20 March 2023)</li><li>Build Phase (starting early to mid-April or earlier)</li></ul>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"until 30 June 2023"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT, NSW, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The seller has capability and capacity to deliver the services within the required timeframe.","weight":"30 %"},{"desc":"Evidence of successful delivery of similar projects. This may include referee checks.","weight":"20 %"},{"desc":"Supplier has a breadth of specialist skill that can be drawn on as needed to service the delivery in the timeline provided.","weight":"10 %"},{"desc":"Suppliers specific experience in Drupal and GovCMS","weight":"40 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","case study","references"]}},{"title":"Modern Device Management Soultion","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=393cc44487692110573d450a0cbb35e5&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nModern Device Management Soultion ID: DM-17923\nAustralian Federal Police\nClosing: 24 March 2023, 11:59PM Canberra time\nCategory: Software Engineering and Development\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17923"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 24 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Australian Federal Police"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Refer to attached RFQ</p>","data":[{"label":"Estimated start date","value":"Friday, 21 April 2023"},{"label":"Initial contract duration","value":"4 Months"},{"label":"Extension term","value":"Other"},{"label":"Extension term details","value":"any number of periods up to 2 months"},{"label":"Number of extensions","value":"Buyer has not provided these details"},{"label":"Location of work","value":"ACT, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Refer to attached RFQ","weight":"40 %"}],"desirable":[{"desc":"Refer to attached RFQ"}]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","case study","resumés","references"]}},{"title":"EL1 Solution Architect - Finance Domain, Melbourne, Sydney, Brisbane","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=51fd5ae587a16510ca450e170cbb35a7&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nEL1 Solution Architect - Finance Domain, Melbourne, Sydney, Brisbane ID: DM-17956\nNational Disability Insurance Agency\nClosing: 28 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17956"},{"label":"RFQ published date","value":"Monday, 13 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 24 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 28 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"National Disability Insurance Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<h3>Mandatory Requirement</h3><p>As part of the eligibility and suitability requirement, NDIA seeks specified personnel who are Australian citizens.</p><p>Applicable for ACT, VIC and QLD: Labour hire licences are required in the state that specified personnel are being contracted.</p><p><br></p><p>The request seeks to engage experienced sellers who have capability to provide a Solution Architect who will be responsible for the ongoing development of systems architecture blueprints for projects across finance domain, with specific focus on delivery of the service enhancement and digital transformation objectives.</p><p><br></p><p><strong>Duties</strong></p><p><br></p><ul><li>Deliver high quality solution architectures that are fit for business purpose</li><li>Align solutions with Agency goals and objectives and Enterprise Architecture reference models, principles, policies, standards and roadmaps</li><li>Liaise with the finance team and key solution stakeholders to ensure expected business outcomes are achieved</li><li>Maintain technical oversight and helps solve complex issues arising during project delivery</li><li>Facilitate technical decision making</li><li>Present the project solution at approval at the appropriate Governance Councils</li></ul><p><br></p><p><br></p><p>Entry Level checks will be required for all successful candidates and dependent on the role the appropriate working with children and/or vulnerable people checks may need to be undertaken as per State Legislation.</p>","data":[{"label":"Estimated start date","value":"Monday, 24 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"NSW, QLD, VIC"},{"label":"Working arrangements","value":"Subject to negotiations with line manager, hybrid working arrangements in line with current NDIS policy are available (minimum of 3 days each week in the office, with flexible arrangements in place for the remaining 2 days). Please refer to draft work order detailing changes to Clauses 27 & 28"},{"label":"Security clearance","value":"Other - Pre-engagement Checks will be undertaken by NDIA and commencement is subject to the Specified Personnel meeting the standard in relation to the Pre-Engagement Check requirements. The Contractor must comply with and ensure ongoing compliance with the Pre-Engagement Checks. NDIA seeks specified personnel who are Australian citizens."},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Bachelor of Science/Business in Information Technology or equivalent tertiary qualification is mandatory"},{"desc":"Excellent listening, communication and stakeholder management skills"},{"desc":"Broad technical & architectural background delivering solution architectures for projects; experience balancing project and program, project and organisational goals, as well as tactical and strategic drivers"},{"desc":"Experience working on finance projects, including working with payments systems, transformation teams, UX/CX designers, and assistant technology enabled (Accessibility Compliant) applications"},{"desc":"Familiar with deployment in public and private government approved cloud and associated security considerations; experience working in both Agile and Structured delivery environments"},{"desc":"Having detailed understanding of digital, mobile and web architectures that leverage API’s, microservices, and stateless token-based authentication and authorization"}],"desirable":[{"desc":"Experience leading finance transformation programs and payments systems"},{"desc":"TOGAF certified or equivalent IT architectural qualification"},{"desc":"Azure or AWS cloud architectural certifications"},{"desc":"Experience in UML & exposure to SalesForce"}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"APS6 Senior Salesforce Administrator - Canberra, Melbourne or Sydney","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=8d2a74a187ad2510ca450e170cbb351b&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nAPS6 Senior Salesforce Administrator - Canberra, Melbourne or Sydney ID: DM-17955\nNational Disability Insurance Agency\nClosing: 24 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17955"},{"label":"RFQ published date","value":"Monday, 13 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 24 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"National Disability Insurance Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<h3>Mandatory Requirement</h3><p>As part of the eligibility and suitability requirement, NDIA seeks specified personnel who are Australian citizens.</p><p>Applicable for ACT, VIC and QLD: Labour hire licences are required in the state that specified personnel are being contracted.</p><p><br></p><p>The request seeks to engage experienced sellers who have capability to provide an experienced and energetic Salesforce Administrator to join our dynamic fast-paced team.</p><p><br></p><p>About the Project:</p><p>The NDIA is committed to providing access to its services for Participants and Providers through digital and cloud channels.&nbsp; We are undertaking a major program of work involving multiple projects spanning a number of current industry-leading technologies, including Salesforce/Industries as a core component.</p><p><br></p><p>Duties</p><ul><li>Maintain and configure Service Cloud, Health Cloud and Digital Experience applications</li><li>Exhibit a deep understanding of the Salesforce platform, with the ability to build end-to-end automated processes using declarative tools</li><li>Investigate and troubleshoot OmniStudio components including FlexCards, Omniscripts, data raptors and integration procedures</li><li>Perform ongoing system administration including maintaining users, monitoring application metrics, managing salesforce configurations and data integrity</li><li>Deployment of changes via existing DevOps framework</li><li>Perform interrogation of various log sources to investigate issues</li><li>Evaluate new releases of Salesforce to determine functionality requirements and provide detailed information on how changes will apply to all affected departments/users</li><li>Develop and maintain documentation on processes and configuration</li><li>Liaise with internal and external stakeholders across various disciplines (business, architecture, data etc.)</li><li>Work within an Agile delivery methodology</li><li>Troubleshooting API and integration issues with different applications e.g. MuleSoft.</li><li>Development of meaningful event monitoring and alerting</li><li>Knowledge transfer and training within the team</li></ul>","data":[{"label":"Estimated start date","value":"Monday, 24 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, VIC"},{"label":"Working arrangements","value":"Subject to negotiations with line manager, hybrid working arrangements in line with current NDIS policy are available (minimum of 3 days each week in the office, with flexible arrangements in place for the remaining 2 days"},{"label":"Security clearance","value":"Must be able to obtain Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"More than 5 years’ experience within Salesforce eco-system"},{"desc":"Experience/Exposure with Salesforce Industries including OmniStudio"},{"desc":"Exposure to OOPs and Apex (Triggers, Controller, Classes) for debugging and managing minor enhancements"},{"desc":"Hands on experience with version control, branching and metadata deployments"},{"desc":"Certified Salesforce Admin ADM201 or ADM211 & Platform App Builder"}],"desirable":[{"desc":"Demonstrable experience providing technical support for Experience Cloud"},{"desc":"Exposure to HTML, CSS and JavaScript is added advantage"},{"desc":"Platform Developer 1 Certification or Vlocity Certification will be a standout"}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Standard Operating Environment (SOE) Integration Engineer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=4cd84b288769e110573d450a0cbb3519&entry=opp_page","type":"Open to all","innerText":"Open to all\nStandard Operating Environment (SOE) Integration Engineer ID: DM-17954\nDepartment of Defence\nClosing: 14 April 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17954"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Wednesday, 12 April 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 14 April 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Commonwealth seeks to engage an Advanced Practitioner as the Standard Operating Environment (SOE) Integration Engineer. This proposal seeks to engage an Engineering and Technical Services Advanced Practitioner to assist with the design, development, build and support of LNIC led ICT capabilities used within both fixed and deployed systems. &nbsp;This RFQTS is for an established vacant position within the Land Network Integration Centre (LNIC).</p><p>The position is primarily a technical hands-on role, with responsibility to conduct capability development, as well as design, build, maintenance and configuration control tasks. This is inclusive of capability development and configuration control tasks of software integration and SOE deployment design (including scripting, build automation, application packaging). This position requires a combination of disciplines including technical hands-on communications engineering, innovation, test and evaluation, and documentation.</p><p>As a technical subject matter expert within a small team the candidate will also be expected to contribute to the design of LNIC led deployable solutions, data centre and/or network integration solutions, as well as review project design documentation and provide advice on integration across Land Combat System (LCS) interfaces.</p><p>It is expected that the majority of services delivered under this contract will be at the LNIC facility in Symonston, ACT. Interstate travel, and possibly international travel, will be required to support TCN trials, liaison with LNBL stakeholders and the support of other ADF field activities. These events will be forecasted by LNIC, booked by the vendor and reimbursed by the Commonwealth.</p><p>A three (3) month period of probation is imposed as a condition of engagement for all new contractors.</p>","data":[{"label":"Estimated start date","value":"Monday, 22 May 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"It is expected that the majority of services delivered under this contract will be at the LNIC facility in Symonston, ACT. Interstate travel, and possibly international travel, will be required to support TCN trials, liaison with LNBL stakeholders and the support of other ADF field activities. These events will be forecasted by LNIC, booked by the vendor and reimbursed by the Commonwealth."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Qualifications, and practical experience in the skills described previously and extensive (greater than 10 years) relevant experience; preferably within Government Local Area Networks within the deployable Defence domain."},{"desc":"Exposure or experience working with deployed networks and exposure with network integration at the tactical and operational levels within the ADF, including interfaces to strategic network boundaries."},{"desc":"Experience applying security best practises in compliance with the Information Security Manual (ISM)."}],"desirable":[{"desc":"The ability to integrate into a high functioning team and to manage their own time and priorities effectively."}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Defence Mission Engineering Support","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=c645f22c1baded10072a98eb274bcbb8&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nDefence Mission Engineering Support ID: DM-17949\nDepartment of Defence\nClosing: 19 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17949"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 19 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The successful tenderers will be expected to provide support services to enable establishment of mission engineering in VCDF Group and Defence more broadly. The required services are as follows:</p><ol><li>Translate strategic guidance and intelligence into accurate characterisations of missions (mission threads) which reflect assessed context, Defence policies, doctrine and concepts.</li><li>Support implementation of mission solutions in collaboration with Capability Managers (CMs) and Delivery Groups (mission engineering threads).</li><li>Application of contemporary analytical methods (trade-off analysis, modelling, mission metrics development).</li><li>Contribute to the evolution of the mission engineering process into a mature Defence process, integral to force design and capability development.</li><li>Support capture and configuration management of mission engineering architecture and detailed design content in a model-based environment.<br></li></ol><p>The contracting approach is based on the following:</p><ol><li>Defence requires the provision of up to five full-time and appropriately qualified Key Persons to deliver the services based on ‘Time and Materials’ (T&amp;M) which will be directed and performed under the supervision of an ADF member.</li><li>The selected candidates can be drawn from different providers.</li><li>The selected candidates will be expected to work from Defence facilities in Canberra.</li><li>The contract period is based on an initial contract to end June 2023 followed by the options for two subsequent one year extensions.</li><li>The initial requirement is currently for up to five individuals however a merit pool of suitable candidates will be established for additional engagement if required.</li></ol>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"5 days per week."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"6"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"EC-1: A minimum of 15 years’ experience relevant to the following: (1) application of ADF doctrine and military operational planning (essential) (2) demonstrated understanding of Defence strategic and policy context (essential) (3) involvement in capability development processes including systems engineering (highly desirable)."},{"desc":"EC-2: Demonstrated ability to undertake analysis, apply critical thinking, and innovate on matters related to military and capability planning."},{"desc":"EC-3: Additional experience (beyond EC-1) and qualifications of the Key Persons offered to provide the Services."},{"desc":"EC-4: Costing estimates and pricing structure."},{"desc":"EC-5: Completeness of response and attention to detail."}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Defence Mission Engineering Support","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=6698166c1b2ded10072a98eb274bcb08&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nDefence Mission Engineering Support ID: DM-17946\nDepartment of Defence\nClosing: 19 March 2023, 11:59PM Canberra time\nCategory: Strategy and Policy(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17946"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 19 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The successful tenderers will be expected to provide support services to enable establishment of mission engineering in VCDF Group and Defence more broadly. The required services are as follows:</p><ol><li>Translate strategic guidance and intelligence into accurate characterisations of missions (mission threads) which reflect assessed context, Defence policies, doctrine and concepts.</li><li>Support implementation of mission solutions in collaboration with Capability Managers (CMs) and Delivery Groups (mission engineering threads).</li><li>Application of contemporary analytical methods (trade-off analysis, modelling, mission metrics development).</li><li>Contribute to the evolution of the mission engineering process into a mature Defence process, integral to force design and capability development.</li><li>Support capture and configuration management of mission engineering architecture and detailed design content in a model-based environment.<br></li></ol><p>The contracting approach is based on the following:</p><ol><li>Defence requires the provision of up to five full-time and appropriately qualified Key Persons to deliver the services based on ‘Time and Materials’ (T&amp;M) which will be directed and performed under the supervision of an ADF member.</li><li>The selected candidates can be drawn from different providers.</li><li>The selected candidates will be expected to work from Defence facilities in Canberra.</li><li>The contract period is based on an initial contract to end June 2023 followed by the options for two subsequent one year extensions.</li><li>The initial requirement is currently for up to five individuals however a merit pool of suitable candidates will be established for additional engagement if required.<br></li></ol>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"EC-1: A minimum of 15 years’ experience relevant to the following: (1) application of ADF doctrine and military operational planning (essential) (2) demonstrated understanding of Defence strategic and policy context (essential) (3) involvement in capability development processes including systems engineering (highly desirable)."},{"desc":"EC-2: Demonstrated ability to undertake analysis, apply critical thinking, and innovate on matters related to military and capability planning."},{"desc":"EC-3: Additional experience (beyond EC-1) and qualifications of the Key Persons offered to provide the Services."},{"desc":"EC-4: Costing estimates and pricing structure."},{"desc":"EC-5: Completeness of response and attention to detail."},{"desc":"EC-6: Current security clearance level no less than NV1."}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references","interview"]}},{"title":"IRAP Assessment preparation - FAM","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=0b62dae087e56110f1afc9150cbb3593&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nIRAP Assessment preparation - FAM ID: DM-17945\nAustralian Institute of Health and Welfare\nClosing: 21 March 2023, 11:59PM Canberra time\nCategory: Cyber Security\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17945"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Australian Institute of Health and Welfare"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Under the Future Analytics Model (FAM), AIHW are building a new cloud-based data analytics environment to support several use cases. The environment is being built in our Microsoft Azure tenancy and leverages Databricks for the analytic capability. It is intended that this environment goes through an IRAP assessment.</p><p>The purpose of this RFQ is to source a vendor to assist in the preparation of the environment for an IRAP assessment including creating/updating security documentation and ensuring the system has implemented appropriate security controls.</p>","data":[{"label":"Estimated start date","value":"Friday, 07 April 2023"},{"label":"Initial contract duration","value":"3 Months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The vendor’s consultants should have demonstrated experience in performing risk assessments and developing security documentation within an Australian federal government context."},{"desc":"The vendor must have availability to complete the work in the specified timeframes."}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references"]}},{"title":"Microsoft Defender 365 Managed Detection and Response","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=d23d86ec8765e110573d450a0cbb3511&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nMicrosoft Defender 365 Managed Detection and Response ID: DM-17944\nDepartment of Finance\nClosing: 24 March 2023, 11:59PM Canberra time\nCategory: Cyber Security\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17944"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Wednesday, 22 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 24 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Finance"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Refer to attachment</p>","data":[{"label":"Estimated start date","value":"Sunday, 24 December 2023"},{"label":"Initial contract duration","value":"36 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"3"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Refer to RFQ 'Statement of Requirements' regarding deliverables for essential criteria.","weight":"100 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","references"]}},{"title":"ICT Cost Model and ICT and Digital Strategies","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=6b8ce1a087a9e1505b220ed90cbb35bf&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nICT Cost Model and ICT and Digital Strategies ID: DM-17938\nComcare\nClosing: 26 March 2023, 11:59PM Canberra time\nCategory: Change and Transformation(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17938"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 26 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Comcare"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Comcare is seeking to develop its future Information and Communications Technology (ICT) Strategy as well as several other key artefacts which directly influence the development of its future ICT environment. Comcare’s current ICT Strategy has been written for the duration of 2019–2023 and is time for a refresh. The current ICT Strategy consists of six workstreams focusing on modernising ICT and the information management processes. Each workstream contributed to delivering key capabilities aligned with Comcare’s current challenges and future priorities including:</p><ul><li><strong>Stakeholder management</strong>— Developing a single view of customer allowing Comcare to better understand its customers and provide better services across the customer base</li><li><strong>Digital services </strong>- Providing a self-service experience so stakeholders can interact with Comcare effectively.</li><li><strong>Enabled workforce—</strong>Using contemporary tools such as robotics, automation and streamlined processes</li><li><strong>Knowledge—</strong> Maximise the value of Comcare’s information by facilitating the knowledge lifecycle</li><li><strong>Platform—</strong> Deliver an agile, adaptive business platform to support Comcare in a dynamic environment without complex ICT infrastructure</li><li><strong>Cyber security—</strong> Ensure Comcare information is appropriately secured against malicious actors</li></ul><p>The new ICT Strategy must continue to establish the key ICT platforms and capabilities that will promote innovation, deliver insight, and underpin comprehensive customer-centric services. In addition to this, the new strategies must address Comcare’s highlighted interest in focusing on emerging technologies in the workforce along with increased data expectations, new opportunities for data sharing, current increase in cyber security and investing in technology to maintain a flexible and agile workforce.&nbsp;<br></p>","data":[{"label":"Estimated start date","value":"Monday, 01 May 2023"},{"label":"Initial contract duration","value":"8 months - 1st May 2023 to 22 December 2023"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, QLD, VIC, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The extent to which the Tenderer has the capability to provide the services as described in the Statement of Requirement","weight":"60 %"},{"desc":"The extent to which the Tenderer has the capacity to provide the services as described in the Statement of Requirement","weight":"40 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","response template"]}},{"title":"Provision of financial systems manager for ad hoc support","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=3f2279601b652150472c1f8c274bcb87&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nProvision of financial systems manager for ad hoc support ID: DM-17940\nNational Archives of Australia\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17940"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"National Archives of Australia"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The NAA is looking to procure a financial systems manager to provide ad hoc support for our costing model.<br><br>The end date of the contract will be 30 June 2023 with no extension options.<br><br><br></p>","data":[{"label":"Estimated start date","value":"Thursday, 16 March 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The work is on an ad hoc basis, providing support when requested by the buyer."},{"label":"Security clearance","value":"Must have Baseline"},{"label":"Maximum number of candidates per seller","value":"1"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"The specialist must have the availability to provide support when requested."},{"desc":"The specialist must be familiar with costing models and have demonstrated capability to provide ongoing support on the costing model."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés"]}},{"title":"User Researchers (x3)","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=b7a406a887e5a110ca450e170cbb355a&entry=opp_page","type":"Open to all","innerText":"Open to all\nUser Researchers (x3) ID: DM-17943\nDigital Transformation Agency\nClosing: 20 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17943"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Digital Transformation Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Digital Transformation Agency is hiring User Researchers for its Digital Sourcing branch to help build a better BuyICT.gov.au and marketplace experience.</p><p>The User Researchers will collaborate with other researchers to conduct studies that help understand user needs, behaviours, and preferences to inform product and service design and development.</p><p>Candidates should hold qualifications in a relevant field or equivalent experience, 4+ years of experience conducting user research, strong analytical skills, and a passion for user-centred design.</p><p>Key responsibilities include planning and conducting user research studies using appropriate methods, analysing research data, collaborating with stakeholders and helping to create and maintain a user-centred design process.</p><p>Understanding of government procurement practices and working in an Agile team is helpful but not essential.</p>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"12 Months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT, NSW, Offsite"},{"label":"Working arrangements","value":"Will be determined based on Candidates location"},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Tell us about a time when you have planned, designed, and conducted user research studies, including interviews, surveys, and/or ethnographic research"},{"desc":"Tell us about a time when you have analysed research data and reported findings to the product team and stakeholders to inform decisions"},{"desc":"Tell us about a time when you have collaborated with stakeholders to inform the design and development of a government digital product or service"}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","interview"]}},{"title":"EAP Program Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=9c03c6ac87e9e1505b220ed90cbb35a4&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nEAP Program Manager ID: DM-17942\nCivil Aviation Safety Authority\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17942"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Civil Aviation Safety Authority"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p><strong>Summary </strong></p>\n<p>Reporting to the Branch Manager of Transformation and Project Director the candidate must undertake the following tasks:</p>\n<ol><li>Define, plan and direct program/scope throughout life cycle, direct scope change activities and direct program/project stage gates.</li><li>Engage and manage a blended team of Business teams, CASA staff and contractors from Information Technology Branch (ITB).</li><li>Work effectively and with influence with key business enabling functions to achieve outcomes for the business.</li><li>Management of resources, budgets and associated activities to support project activities and deliverables.</li><li>Develop project plans and provide detailed status reports on progress and budget;</li><li>Work co-operatively and collaboratively with the (ITB) team, as well as other stakeholders within CASA.</li><li>Identify program/project quality requirements, conduct quality assurance and manage the quality management process.</li><li>Assist in the design and Implementation of risk management strategies in relation to change activities.</li><li>Stakeholder, change and communication management.</li><li>Other related tasks as requested by the Project Director and Branch Manager Transformation.</li></ol>\n<p><strong>Mandatory</strong></p>\n<ol><li>Ten or more years of demonstrated Project management experience in business led projects, with complex multi-faceted deliverables across business.</li><li>Demonstrated experience in stakeholder and change management.</li><li>Highly developed communication (oral and written) skills with the ability to clearly articulate information to influence a wide variety of stakeholders and subject matter experts.</li><li>Strong project governance experience, including ability to use tools such as Microsoft Project, with evidence of practical application.</li><li>Demonstrated experience in managing diverse and blended teams.</li><li>Experience working in or demonstrated understanding of complex regulatory environments, and ability to learn quickly the underpinning legislative framework(s)</li><li>Experience with one or more project/program management methodologies (such as PRINCE2, Agile, Scrum and MSP [managing successful programs]).</li><li>Effective influencing and negotiation experience and skills in an environment with high competition for resources.</li><li>Excellent analytical and execution skills.</li></ol>\n<p>&nbsp;</p>\n<p><strong>Location </strong></p>\n<p>Based in Aviation House, Phillip, ACT the Resource must work (on average) 8 hours per day (40 hours per week) between the core hours of 8.00am and 5.00pm Monday to Friday.</p>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"from Contract Commencement date until 30 June 2023"},{"label":"Extension term","value":"Other"},{"label":"Extension term details","value":"Two (2) x 12 months or parts thereof"},{"label":"Number of extensions","value":"Buyer has not provided these details"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The Resource must work (on average) 8 hours per day (40 hours per week) between the core hours of 8.00am and 5.00pm Monday to Friday."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated capability of the candidate to satisfy the specification of the requirements"},{"desc":"Demonstrated experience of the candidate in the delivery of the services required"},{"desc":"A guaranteed and competitive pricing structure that incorporates all known fixed charges/taxes etc."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","interview"]}},{"title":"Professional Services to Resolve Microsoft Teams and OneDrive Issues","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=dfb8b12087e9e1505b220ed90cbb3542&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nProfessional Services to Resolve Microsoft Teams and OneDrive Issues ID: DM-17941\nNational Archives of Australia\nClosing: 14 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17941"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"National Archives of Australia"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>National Archives of Australia is seeking a quote for named personnel with a minimum of Negative Vetting 1 clearance, with skills and experience with Microsoft Teams and OneDrive implementations.</p><p>NAA has an immediate need to onboard a specialist for a two week engagement, to be embedded within its ICT Service Desk.&nbsp; The specified personnel will troubleshoot and resolve a series of issues related to MS Teams, specifically issues with joining meetings and making phone calls.&nbsp; They will also troubleshoot and resolve issues related to OneDrive.</p><p>The preferred candidate will have a strong background in these M365 capabilities.</p><p>NAA is seeking a daily rate, inclusive of GST.</p><p>The contract period will be through until 30 June 2023, with two x 3 month option periods.&nbsp; This will allow NAA to reengage with the seller and onboard named personnel to provide ad hoc support if M365 problems emerge.</p><p><br></p>","data":[{"label":"Estimated start date","value":"Friday, 17 March 2023"},{"label":"Initial contract duration","value":"Until 30 June 2023"},{"label":"Extension term","value":"3 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"NAA need the specified personnel to be onsite at its ACT Mitchell office, Monday to Friday during business hours to be embedded within the ICT Service Desk. After hours work may be required on occasion where a change request is to be implemented after business hours."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"4"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Strong understanding of NAA implementation of Microsoft Teams, with the skills and experience required to troubleshoot and resolve issues experienced by end users."},{"desc":"Strong understanding of NAA implementation of Microsoft OneDrive, with the skills and experience required to troubleshoot and resolve issues experienced by end users."}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés"]}},{"title":"Organisational Designer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=3165fd9c1be9ad103fa942ebdc4bcb21&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nOrganisational Designer ID: DM-17936\nDepartment of Climate Change, Energy, the Environment and Water\nClosing: 19 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17936"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Saturday, 18 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Sunday, 19 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Climate Change, Energy, the Environment and Water"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p><strong>Please note: Specific sellers are invited to respond to this opportunity, due to the scale and scope of the procurement. The Department will not be including additional sellers to respond to this opportunity</strong></p><p><br></p><p>The Department of Climate Change Environment Energy and Water (DCCEEW) requires the services of an experienced Organisational Designer who has capability to undertake organisational design services for the purpose of capturing a target operating state for the ICT aspects of the newly formed Department. The review will capture the interim state (as at inception), target state for 30 June 2023 and a target state operating model.</p><p><br></p><p>Key deliverables:</p><p>Capture a draft current state operating model including interfaces with DAFF as the shared service provider.</p><ul><li>Capture a draft interim state (EOFY) and target state operating model, with focus on the processes within the footprint of DCCEEW IT.</li><li>Socialise the current, interim and target state operating models, with the view to baselining and achieving acceptance of these by the DCCEEW IT leadership team and Chief Information Officer.</li><li>Undertake consultation within DCCEEW IT, and to a limited extent with key personnel in DAFFs Digital Services Division to capture the current state operating model.</li><li>Liaise with key stakeholders in DCCEEW to identify opportunities to achieve an interim state operating model (EOFY) and target state operating model.</li></ul><p><br></p><p>Refer to the statement of requirements document for specific details of the RFQ.</p><p><br></p><p>Rates are not to be included in the submitted CV. Failure to adhere to this will result in the application not being compliant and therefore will not be assessed.&nbsp;</p>","data":[{"label":"Estimated start date","value":"Wednesday, 31 May 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Positions are based in our Canberra offices. Whist the department’s current Working Away from the Office (WAFO) policy encourages staff to work in the office for a minimum of 40% of the time, the team requirements are that people work in the office for a minimum of 60% of the time or 3 days a week. Variations can be discussed with the supervisor but any request for less hours in the office will need to be supported by the Director or Branch head and approved by the CIO."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated understanding of the scope of the deliverables and experience in delivering similar outcomes.","weight":"20 %"},{"desc":"Ability and description of how the required outcomes will be delivered within the timeframe.","weight":"20 %"},{"desc":"Demonstrated experience with organisational design skills and an ability to capture current state and translate this into a pragmatic target operating model for ICT.","weight":"20 %"},{"desc":"Demonstrated extensive stakeholder engagement skills: • Ability to elicit requirements from various stakeholders o Ability to effectively elicit and communicate with a broad range of stakeholders.","weight":"20 %"},{"desc":"Ability to depict the translation of current state and identification of future state in a non-technical, easily digestible format.","weight":"10 %"},{"desc":"Ability to distil a complex operating environment into fundamental processes and document these in a succinct manner.","weight":"10 %"}],"desirable":[{"desc":"Experience working within federal government and experience with change and integration, including Machinery-of-Government movements."}]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references"]}},{"title":"AGA Digital Product – GovCMS Pilot","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=5565fd1087e96110ca450e170cbb3583&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nAGA Digital Product – GovCMS Pilot ID: DM-17935\nDigital Transformation Agency\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: Agile Delivery and Governance(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17935"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Digital Transformation Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Please see attached Requirements Document.</p><p>The response is to explicitly indicate availability to support urgency to commence around:</p><ul><li>Design Phase (starting within 14 days commencing the 20 March 2023)</li><li>Build Phase (starting early to mid-April or earlier)</li></ul>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"until 30 June 2023"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT, NSW, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The seller has capability and capacity to deliver the services within the required timeframe.","weight":"30 %"},{"desc":"Evidence of successful delivery of similar projects. This may include referee checks.","weight":"20 %"},{"desc":"Supplier has a breadth of specialist skill that can be drawn on as needed to service the delivery in the timeline provided.","weight":"10 %"},{"desc":"Suppliers specific experience in Drupal and GovCMS","weight":"40 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","case study","references"]}},{"title":"Modern Device Management Soultion","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=393cc44487692110573d450a0cbb35e5&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nModern Device Management Soultion ID: DM-17923\nAustralian Federal Police\nClosing: 24 March 2023, 11:59PM Canberra time\nCategory: Software Engineering and Development\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17923"},{"label":"RFQ published date","value":"Friday, 10 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 24 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Australian Federal Police"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Refer to attached RFQ</p>","data":[{"label":"Estimated start date","value":"Friday, 21 April 2023"},{"label":"Initial contract duration","value":"4 Months"},{"label":"Extension term","value":"Other"},{"label":"Extension term details","value":"any number of periods up to 2 months"},{"label":"Number of extensions","value":"Buyer has not provided these details"},{"label":"Location of work","value":"ACT, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Refer to attached RFQ","weight":"40 %"}],"desirable":[{"desc":"Refer to attached RFQ"}]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","case study","resumés","references"]}},{"title":"Solutions Architect – MELBOURNE (Richmond) only (108012)","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=b029599c1b2dad10072a98eb274bcbcc&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nSolutions Architect – MELBOURNE (Richmond) only (108012) ID: DM-17934\nNational Disability Insurance Agency\nClosing: 21 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17934"},{"label":"RFQ published date","value":"Thursday, 09 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"National Disability Insurance Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<h3>Mandatory Requirement</h3><p>As part of the eligibility and suitability requirement, NDIA seeks specified personnel who are Australian citizens.</p><p>Applicable for ACT, VIC and QLD: Labour hire licences are required in the state that specified personnel are being contracted.</p><p><br></p><p>Purpose</p><p>This role is responsible for ongoing development of systems architecture blueprints for projects across the Scheme participant, provider and partner domains, with specific focus on delivery of the service enhancement and digital transformation objectives.</p><p>Duties</p><p><br></p><ul><li>Deliver high quality solution architectures that are fit for business purpose</li><li>Align solutions with Agency goals and objectives and Enterprise Architecture reference models, principles, policies, standards and roadmaps</li><li>Liaise with solution stakeholders to ensure expected business outcomes are achieved</li><li>Maintains technical oversight and helps solve complex issues arising during project delivery</li><li>Facilitate technical decision making</li><li>Present the project solution at approval at the appropriate Governance Councils</li></ul>","data":[{"label":"Estimated start date","value":"Sunday, 17 December 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"VIC"},{"label":"Working arrangements","value":"Subject to negotiations with line manager, hybrid working arrangements in line with current NDIS policy are available (minimum of 3 days each week in the office, with flexible arrangements in place for the remaining 2 days)."},{"label":"Security clearance","value":"Other - Pre-engagement Checks will be undertaken by NDIA and commencement is subject to the Specified Personnel meeting the standard in relation to the Pre-Engagement Check requirements. The Contractor must comply with and ensure ongoing compliance with the Pre-Engagement Checks. NDIA seeks specified personnel who are Australian citizens."},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Bachelor of Science/Business in Information Technology or equivalent tertiary qualification is mandatory."},{"desc":"Excellent listening, communication and stakeholder management skills."},{"desc":"Broad technical & architectural background delivering solution architectures for projects. Experience balancing project and program, project and organisational goals, as well as tactical and strategic drivers."},{"desc":"Experience working on cloud-based projects, including working with digital transformation teams, UX/CX designers, and assistant technology enabled (Accessibility Compliant) applications."},{"desc":"Familiar with deployment in public and private government approved cloud and associated security considerations."},{"desc":"Having detailed understanding of digital, mobile and web architectures that leverage API’s, microservices, and stateless token-based authentication and authorization."}],"desirable":[{"desc":"Experience with personalization and delivery of relevant managed content to digital channels."},{"desc":"Experience working in both Agile and Structured delivery environments."},{"desc":"TOGAF certified or equivalent IT architectural qualification; Azure or AWS cloud architectural certifications."},{"desc":"Experience in UML and exposure to Salesforce and MuleSoft desirable."}]},"submit":["start date","daily rate","responses to selection criteria","resumés","interview"]}},{"title":"Business Analyst","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=4423df2b1b192d103fa942ebdc4bcb3b&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nBusiness Analyst ID: DM-17910\nClean Energy Regulator\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: Agile Delivery and Governance\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17910"},{"label":"RFQ published date","value":"Thursday, 09 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Clean Energy Regulator"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Clean Energy Regulator (CER) requires an appropriately skilled and experienced Business Analyst to undertake an Information Review, help develop the CER’s Information Governance Framework and initiate the Business System Assessments process for the CER.<strong> <br><br>An information review</strong> is a key component of an effective information governance program and will help the Chief Information Governance Officer (CIGO):</p><ul><li>Conduct an Information Review using the National Archives of Australia’s (NAA’s) recommended approach.</li><li>Use the outcome of the Information Review to help develop the CER’s Information Governance Framework.</li><li>Identify the CER’s most valuable information assets.</li><li>Support enterprise-wide governance for records, information, and data.</li></ul><p><strong>Business System Assessment: </strong>The NAA’s Business System Assessment Framework provides a consistent, streamlined, risk-based approach to the assessment of information management functionality in business systems. Conducting Business System Assessments on the CER’s information systems (repositories) will enable the CER to better manage its business information through:&nbsp;</p><ul><li>Assessing information and data risks and values;</li><li>Identifying the systems functionality required to manage information and data appropriately;</li><li>Providing solutions to address gaps in a system's ability to manage information and data; and</li><li>Ensuring greater accountability and transparency.</li></ul>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"6 Months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Experience in information management within Australian Government agencies."},{"desc":"Ability to engage with a variety of stakeholders to identify and document processes relating to information management."}],"desirable":[{"desc":"Experience in conducting Information Reviews and other information management related functions."},{"desc":"Experience with records management technologies within Australian Government agencies."}]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references","interview"]}},{"title":"2025-2022-23 Senior Developer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=769ab49c1ba9ad10072a98eb274bcb27&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\n2025-2022-23 Senior Developer ID: DM-17929\nBureau of Meteorology\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17929"},{"label":"RFQ published date","value":"Thursday, 09 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 16 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Bureau of Meteorology"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Application Senior Developer (SD) will work on one or more Application projects and be the primary resource within a project team to lead development activities, build/refactoring and deployment of new and remediated code. This is application migration/upgrade as well as deployment of new applications.&nbsp;</p><p>No further invitations to participate in this opportunity will be extended to further agencies.</p><p><br></p><p>Sellers are reminded of Seller as sole&nbsp;representative.<strong>&nbsp;</strong>Please refer to the RFQ for details.</p><p><br></p><p>Sellers are reminded of Compliance with State and Territory labour hire licensing laws. The primary location of any candidate(s) submitted by the seller: • should comply with the primary location specified in this RFQ, and • must be in a State or Territory where the Seller complies with any applicable State or Territory labour hire licensing laws.</p>","data":[{"label":"Estimated start date","value":"Monday, 17 April 2023"},{"label":"Initial contract duration","value":"30-06-2024"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"QLD, VIC"},{"label":"Working arrangements","value":"The Bureau has made arrangements to transition staff to working on-site, partly working from home and partly working in the office."},{"label":"Security clearance","value":"Other - At commencement: 1. be eligible for Baseline Security Clearance at a minimum and NV1 Security Clearance where required by the Bureau, and 2. have up-to-date police check with no qualifications or disclosable outcomes. Security Clearance, candidates are required to meet certain pre-screening requirements, including evidence of Australian citizenship."},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Please refer to SOR"}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Project Support Officer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=0830d0d887e12110f1afc9150cbb35cf&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nProject Support Officer ID: DM-17927\nDepartment of Defence (SA)\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17927"},{"label":"RFQ published date","value":"Thursday, 09 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Defence (SA)"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Australian Cyber Security Centre delivers a range of cutting-edge ICT projects aimed at making Australia the safest country in the world to connect and conduct business on-line including:</p>\n<ul><li>Disrupting cyber crime</li><li>Achieving persistent visibility of Critical Infrastructure IT network security</li><li>Developing Cyber Threat Intelligence</li><li>Improving engagement across government, industry and community</li><li>Improving national cyber situational awareness</li></ul>\n<p>A Project Support Officer is required to work within the Australian Signals Directorate’s Cyber Security Centre to support the program and provide administrative support for a range of technically orientated projects and diverse stakeholders.</p>\n<p><strong>Key knowledge or experience required include:</strong></p>\n<ul><li>Assisting with program and project planning and drafting of program artefacts.</li><li>Coordinating program reporting and preparing program management dashboards, reporting processes and artefacts.</li><li>Assisting with general administrative tasks to define and maintain registers, access controls and quality processes.</li><li>Record management of program artefacts ensuring all program artefacts are entered into the Electronic Document and Records Management System (EDRMS).</li><li>Maintaining program and project risk register(s), including scheduling regular reviews and updates; and facilitating risk meetings.</li><li>&nbsp;Investigate issues of medium complexity and produce related briefs for SES officer consumption.</li><li>Preparation of governance packs for program and project boards and conduct as board secretariat.</li><li>Demonstrated administration and organisational skills within Defence’s Desktop Environments.</li><li>Proficiency in using Microsoft Suite (MS Word, MS Excel, PowerPoint, MS Visio) which is necessary for the creation of visually and verbally engaging reports for the various assigned departmental heads, management and stakeholders.</li><li>Attention to detail in delivering timely, accurate work.</li><li>Excellent interpersonal skills and a demonstrated ability to employ a variety of tailored communication skills (verbal and written).</li><li>Excellent work ethic, able to self-manage and progress tasks independently. &nbsp;</li></ul>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The successful candidates will be expected to work 5 days per week (estimated 40 hour week), initially from the Canberra site with consideration given to some remote work once established. ACSC is committed to remaining an exemplar in our response to COVID-19. We have a flexible workforce and have aligned our work environment to meet restrictions implemented by the ACT Government arrangements. Current engagements at ACSC are dependent upon ensuring compliance with these restrictions and meeting our specific business needs. If a program of work is unable to be delivered virtually during lockdown, then a mutually agreed delayed commencement will be considered. Recruiters please note: Candidates who do not address the essential criteria are likely to be found unsuitable. Note: An Organisational Suitability Assessment (OSA) is a mandatory requirement for contracted staff working in ASD beyond 12 months. Before submitting an application for this position, the applicant must have considered their preparedness for questions that may include the following topics: personal relationships, living circumstances, personal values, financial situation, physical and mental health history including substance use, and any civil and/or military record. OSAs are conducted to determine suitability to work in a high security environment. All employees must obtain and maintain the required security clearance to work in ASD. If you are currently employed in the Australian Intelligence Community or the ADF, you will be provided with feedback on your OSA if the outcome has an adverse bearing on your current employment. No feedback will be provided on the outcome of the psychological assessment process to any other applicant."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"1"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated experience (a minimum of 5 years) supporting a program or project by providing a cross program view on risk, change, quality, finance and configuration management."},{"desc":"Experience in assisting programs and projects with risk, governance and assurance activities."},{"desc":"Knowledge of Project and Program Management methodologies, including MSP, Prince2, Prince2Agile and SAFE."}],"desirable":[{"desc":"Possesses excellent verbal and written communication skills with a proven history of working in complex Defence or Government programs or projects contributing to organisational capability."},{"desc":"Experience with the Defence desktop environment and associated applications including the Microsoft Office suite of tools (Word, Excel, Outlook, Visio, Project), ROMAN, Objective and JIRA."}]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Level 1/2 Service Desk Analyst","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=51680fe71b592d10072a98eb274bcbc0&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nLevel 1/2 Service Desk Analyst ID: DM-17909\nDepartment of the Treasury\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17909"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 10 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of the Treasury"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The IT Service Desk provides essential support to Treasury’s IT Services environment. The successful application will have prior experience as a service desk analyst, The successful applicant will have the following:<br><br>• Prior experience on the IT Service Desk<br>• A strong customer focus and strong troubleshooting skills<br>• Ability to answer phones confidently<br>• Experience documenting incidents through the service management capability<br>• Experience with; AD, User accounts management, resource groups, distribution lists, front facing exchange features and elevated permissions • Flexibility with working roster<br>• To be physically capable of moving and lifting equipment such as monitors, desk printers &amp; other general IT assets<br>• Managing allocated workload and priorities on a day-to-day basis<br></p><p><br></p><p>Required skills and knowledge:</p><p>• Demonstrated experience in an ICT environment<br>• Demonstrated experience working with Executive and Ministers<br>• Ability to communicate effectively across all ICT support levels</p>","data":[{"label":"Estimated start date","value":"Monday, 27 March 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Monday to Friday. Start and finish times vary."},{"label":"Security clearance","value":"Must have Baseline"},{"label":"Maximum number of candidates per seller","value":"6"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Service Desk experience. Strong customer focus. Team oriented."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","interview"]}},{"title":"TechnologyOne System Administration Services","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=bb4dd8c81b29e91035320edbdc4bcbd0&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nTechnologyOne System Administration Services ID: DM-17925\nClean Energy Regulator\nClosing: 16 March 2023, 11:59PM Canberra time\nCategory: Support and Operations\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17925"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Thursday, 16 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Clean Energy Regulator"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The selected provider will provide Systems Administrator services that will support the Clean Energy Regulator by maintaining the consistent operation and enhancement of TechnologyOne (TechOne).&nbsp;</p>","data":[{"label":"Estimated start date","value":"Friday, 24 March 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The extent to which the specified personnel have the relevant experience to undertake the Services."}],"desirable":[{"desc":"The extent to which the organisation has relevant experience in providing the Services."},{"desc":"The extent to which the proposed fees offer value for money to the Agency."}]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés"]}},{"title":"Penetration testing services","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=67a85f7387152110ca450e170cbb3511&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nPenetration testing services ID: DM-17918\nAustralian Competition and Consumer Commission\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: Cyber Security\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17918"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Australian Competition and Consumer Commission"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The ACCC requires services to conduct a number (up to six) penetration tests, each comprising:</p><ul><li>Testing one, or a combination, of components of the ACCC’s Azure cloud infrastructure, databases, network devices, portal and websites</li><li>Development of a penetration test plan (in conjunction with the ACCC IT teams)</li><li>Execution of the agreed plan</li><li>Report detailing the test results and associated recommendations.<br></li></ul><p><br></p><p>This will involve the following document deliverables to the ACCC for each test:</p><ul><li><strong>Penetration Test Plan</strong> – detailing the agreed test approach and scope. The plan is to specifically address the:<ul><li>Planned sequence of test activities and associated timeframes,</li><li>Toolsets to be employed (together with any requirement for software to be installed on ACCC or third-party infrastructure),</li><li>Dependencies (including those relating to ACCC or third-party involvement), and</li><li>Resource requirements (resourcing as well as any ACCC resources or third-party required to support the testing effort).</li></ul></li><li><strong>Penetration Test Report</strong> – detailing the results of the planned testing program and including an assessment of these results which addresses:<ul><li>Areas of system tested and not tested;</li><li>the vulnerabilities identified and the nature and extent of the associated risk, and</li><li>recommendations for treating the vulnerabilities and risks identified.</li></ul></li></ul>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"To 30 June 2023"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, NT, QLD, SA, TAS, VIC, WA, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Demonstrated skills and expertise in penetration testing applications, databases, network devices and cloud infrastructure (MS Azure preferred)"},{"desc":"Demonstrated understanding and demonstrated ability: to use different attack types/methods to test environment; of various methodologies for penetration testing; and to review code for security vulnerabilities"},{"desc":"Demonstrated ability and experience: to document security and compliance issues (especially with reference to PSPF and ISM); in writing technical and executive reports; to communicate findings to both technical and executive leadership; and to make suggestions to improve security"},{"desc":"At least Negative Vetting Level 1 security clearance is required for all resources performing penetration testing services"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references"]}},{"title":"Project Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=40eeff7b1b95e91035320edbdc4bcb0c&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nProject Manager ID: DM-17921\nDepartment of Defence\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17921"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>DST is the Australian Government's lead agency dedicated to providing science and technology support for the country's defence and security needs. Within DSTG, the Digital Science, Science Computing (DSSC) Team, has a central role in the planning, management and support of eResearch services across DST Group, is seeking the services of 1 x Project Managers with suitable skills and experience to address the following: </p><p>o Experience managing complex ICT projects including<br>o Scope, schedule and budget management<br>o Risk and issue management<br>o Stakeholder management<br>o Strong knowledge and experience in using Microsoft Project to manage schedule<br>o Excellent written and verbal communication skills including<br>o Ability to communicate and build relationships at all levels<br>o Strong client engagement skills<br>o Located in Canberra</p>","data":[{"label":"Estimated start date","value":"Tuesday, 04 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Already in place and discussed."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"1"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Upload e-mail to respond to opportunity. o Experience managing complex ICT projects including o Scope, schedule and budget management o Risk and issue management o Stakeholder management o Strong knowledge and experience in using Microsoft Project to manage schedule o Excellent written and verbal communication skills including o Ability to communicate and build relationships at all levels o Strong client engagement skills"}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés"]}},{"title":"P23/79 ICT Program / Project Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=90bfb3bb1bd56d103fa942ebdc4bcbc1&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nP23/79 ICT Program / Project Manager ID: DM-17922\nAustralian Criminal Intelligence Commission\nClosing: 20 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17922"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 16 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Criminal Intelligence Commission"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Australian Criminal Intelligence Commission (ACIC) is seeking a suitably qualified and experienced Program / Project Manager to support a number of current and upcoming ACIC ICT projects.</p><p>The expected roles and responsibilities are to:</p><ul><li>Lead and manage ICT project(s) or a program of work which contribute to the ACIC’s strategic outcomes and objectives, in accordance with corporate standards for project management and ensure projects integrate with the ACIC’s business.</li><li>Document and manage the start-up, initiation, delivery and closure of projects in accordance with corporate project management standards, which are based upon PRINCE2.</li><li>Develop and/or update Business Cases for large and complex ICT projects.</li><li>Develop and maintain an accurate project schedule and deliver products according to the schedule.</li><li>Develop and maintain the project budget, and track costs and expenditure to deliver the project within tolerances.</li><li>Manage scope, quality, risk and issue management processes to ensure outcomes are delivered.</li><li>Identify, acquire and manage project staff and provide effective direction and leadership to the project team.</li><li>Engage with an extensive array of stakeholders on any given project. The role is required to initiate, establish and maintain strong relationships with: (1) Internal stakeholders to ensure access to resources and alignment with other interrelated projects; and (2) External stakeholder and business partners to ensure current and emerging needs are addressed.</li><li>Manage procurement and contracts for one or more vendors and manage complex issues.</li><li>Formally attend project and program board meetings, prepare reports, advice and recommendations for presentation at more senior governance forums as required.</li><li>Have and apply a comprehensive knowledge of principles, practices and theories as they relate to effective project management, with particular regard to PRINCE2 methodologies, together with the ability to apply these within ACIC.</li></ul>","data":[{"label":"Estimated start date","value":"Thursday, 25 May 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"On-site full time for a minimum of 6 months. Working from home arrangements may be negotiated after 6 months, with no more than 2 days away from the office."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"5"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"A minimum of four years’ experience in successful management of complex projects and/or programs which comply with corporate standards, meet the needs of users and deliver intended benefits."},{"desc":"Experience in the design, planning and execution of projects which utilise a range of selected tools and methodologies and are underpinned by a sound understanding of ICT technical disciplines."},{"desc":"Demonstrated ability to establish and lead multi-disciplinary teams which operate effectively in delivering results and responding positively to change."},{"desc":"High level skills in communication and engagement with stakeholders to ensure that project products align with business strategy and meet business requirements"},{"desc":"Demonstrated excellence in written and verbal communications evidenced by your experience in preparing a range of written materials including business cases, project documents and reports to key stakeholders in a Government context, as well as your ability to quickly build trust and effectively manage the expectations of stakeholders and team members."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Information Security Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=cb8a8f7f87d12110573d450a0cbb359b&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nInformation Security Manager ID: DM-17917\nDepartment of Defence\nClosing: 21 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17917"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 21 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>See attached Request for Quote document.</p>","data":[{"label":"Estimated start date","value":"Monday, 11 December 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"ACT, Offsite"},{"label":"Working arrangements","value":"• There is an expectation that the successful candidate will work 5 days per week and up to a maximum of 40 hours per week unless pre-approved by the ASD Contract Manager. • The role is Canberra based, primarily working from the ACSC office in Majura Park. Work from home arrangements may be considered."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"1"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated capability and capacity to perform the indicative duties as set out in the Requirements section of this RFQ."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés"]}},{"title":"AGD-ICT-RFQ-332 - Disaster Recovery Review March 2023","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=3a13f76f1b91e910796b0edbdc4bcbf5&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nAGD-ICT-RFQ-332 - Disaster Recovery Review March 2023 ID: DM-17913\nAttorney-General's Department\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: Cyber Security\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17913"},{"label":"RFQ published date","value":"Wednesday, 08 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 10 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Attorney-General's Department"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>See Attached Document - AGD-ICT-RFQ-332 Disaster Recovery Review March 2023 - Requirements</p>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"6 months"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"See Attached"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","references"]}},{"title":"Level 1 & 2 support officer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=6a1ebba71bd1e910796b0edbdc4bcbc6&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nLevel 1 & 2 support officer ID: DM-17914\nAdministrative Appeals Tribunal\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17914"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Administrative Appeals Tribunal"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The IT Support Officer is responsible for: 1. Providing high quality, responsive, courteous and timely 1st and 2nd level IT support to members and staff of the AAT. This includes: a. being available to adequately cover Service Desk functions as rostered/required b. monitoring and managing IT support requests through the Service Desk system, telephone and personal presentation; c. Ensuring issues are documented correctly and resolved in a timely fashion 2. Fostering effective and productive working relationships with internal and external AAT stakeholders. This may include: a. liaising with external service providers in relation to support arrangements, procurement, invoicing and other tasks as required b. communicating technical information to non-technical members and staff 3. Test, install and maintain computers, peripherals, videoconferencing, office equipment, software, logs and security systems as required. 4. Maintain and monitor backup procedures, communications and security systems. 5. Undertake project work as directed.</p>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"VIC"},{"label":"Working arrangements","value":"On site 5 days per week"},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"6"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Experience in support a. Experience providing 1st level and 2nd IT support in a Microsoft environment. b. Understanding of networking c. Experience installing and trouble-shooting PCs and peripherals d. Problem solving skills"},{"desc":"Customer service e. Strong customer service focus f. Conflict resolution skills g. Understanding of the need to follow up to ensure clients are satisfied and to keep them informed of the progress of any issues logged"},{"desc":"Communication and liaison skills h. Ability to document solutions and communicate solutions to the rest of the Information technology team i. Ability to develop simple instructions for use by clients j. Ability to convey technical information to non-technical staff"},{"desc":"Flexibility and initiative k. Ability to contribute to project work as directed l. Ability to learn new technologies and applications m. Ability to prioritise work and cope with multiple demands n. Ability to respond to changing work demands and circumstances"},{"desc":"Education o. Tertiary qualifications in Information Technology p. and/or Industry related training and qualifications"}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Implementation of Chocolatey Software in DEWR Non-Production Environment","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=cad5faab1b952d103fa942ebdc4bcbdd&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nImplementation of Chocolatey Software in DEWR Non-Production Environment ID: DM-17905\nDepartment of Education, Skills and Employment\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: ICT Systems Integration\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17905"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Education, Skills and Employment"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Department of Employment and Workplace Relations (DEWR) seeks to engage an experienced service provider who has the capabilities to provide the Implementation of Chocolatey Software in the DEWR non-production environment.&nbsp;</p><p>Key responsibilities are listed below;&nbsp;</p><ol><li>&nbsp;Capability<ul><li>Draft documents and design in accordance with Australian Government security standards.</li><li>Provide technical support for implementation.</li></ul></li><li>Capacity<ol><li>Resourcing requirements</li></ol></li></ol><ul><li>Vendor to determine resourcing requirements in line with quote.</li></ul><ol><li>Experience</li></ol><ul><li>Previous experience in design and automating Chocolatey for Business.</li><li>Experience in Microsoft Azure including Azure DevOps.</li><li>Experience using repositories and Service Now automation systems.</li><li>Previous experience working within the Australian Government.</li></ul><ol><li>Expertise</li></ol><ul><li>Vendor must provide resumes of proposed personnel.</li></ul><ol start=\"3\"><li>Compliance<ol><li>Standards</li></ol></li></ol><ul><li>Microsoft Azure certification.</li></ul><ol><li>Security Requirements</li></ol><ul><li>Minimum baseline security clearance</li></ul><ol><li>Work, Health and Safety</li></ol><ul><li>DEWR has a primary duty of care for the health and safety of workers including contractors and consultants engaged to undertake the scope of work set out in the Requirements document.&nbsp;&nbsp;</li><li>All staff and contractors engaged by DEWR are in a position to help DEWR meet their duty and provide assurance of compliance with the law.&nbsp;</li><li>The DEWR project manager will need to be consulted about matters that affect, or are likely to affect, the health and safety of the project team members.&nbsp;</li></ul><ol start=\"4\"><li>Pricing<ul><li>Pricing must be quoted as time and materials.</li></ul></li></ol>","data":[{"label":"Estimated start date","value":"Wednesday, 29 March 2023"},{"label":"Initial contract duration","value":"ASAP to 30 June 2023"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Please see attached Requirements document."}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references","interview"]}},{"title":"Financial, HR and CRM Systems Implementtion","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=ddedb6ef87952d10ca450e170cbb356d&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nFinancial, HR and CRM Systems Implementtion ID: DM-17907\nRoyal Australian Navy Central Canteens Board\nClosing: 20 March 2023, 11:59PM Canberra time\nCategory: ICT Systems Integration\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17907"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Royal Australian Navy Central Canteens Board"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Royal Australian Navy Central Canteens Board (RANCCB) t/a The Navy's Anchorage, is a Commonwealth Corporate Entity within the Defence portfolio and reports in accordance with the <em>Public Governance, Performance and Accountability Act 2013. </em>RANCCB currently uses Xero as its Financial Management Information System (FMIS) and Employment Hero as its payroll/HR system. Xero has been in use since 1 July 2021 where it replaced Attaché which had been in use since 2018. Employment Hero has bee in use since 2020.</p><p>During the 2021-22 audit, the Australian National Audit Office (ANAO) determined that both Xero and employment Hero did not fully comply with the Commonwealth Government IT control and audit requirements, and as such RANCCB received a number of audit findings. RANCCB has decided, in part in response to the audit findings, to replace both Xero and Employment Hero with a fit-for-purpose IT system(s). However, due to expected growth of the organisation over the next few years, RANCCB has determined that it is also an opportunity to upgrade systems that will provide management with an enhanced level of analysis and reporting around financial, HR and customer relationship management (CRM) data.</p>","data":[{"label":"Estimated start date","value":"Tuesday, 28 March 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"The criteria as per section 3 of the RFQ."}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","response template","presentation"]}},{"title":"Require Penetration Testing for Budget website","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=8f34e2ef8719e910f1afc9150cbb35c7&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nRequire Penetration Testing for Budget website ID: DM-17903\nDepartment of the Treasury\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: Cyber Security(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17903"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Saturday, 11 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of the Treasury"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The Department of the Treasury seeks to engage experienced Cyber Security consultants who have the capability of performing Pentest on websites. The budget website was previously hosted on AWS platform, that has now been migrated to Microsoft Azure platform. We are looking for an experienced pen tester to have the budget website pen tested, as a part of this we would also like a load testing on the current budget website on AWS done. The scope of this engagement also includes testing all static websites that will be moved to the Microsoft Azure environment.</p><p><br></p><p>As the part of this engagement the security consultants will be responsible for, but not limited to:</p><p>&nbsp;<br>• &nbsp; &nbsp;Develop and execute complex test artefacts which are aligned to requirements, using Azure Dev Ops.<br>• &nbsp; &nbsp;Analyse outcomes, accurately document results, report and manage defects.&nbsp;<br>• &nbsp; &nbsp;Work collaboratively with developers and other testers to identify and retest issues.<br>• &nbsp; &nbsp;Develop and support internal and external relationships to achieve work area and agency goals. &nbsp;<br>• &nbsp; &nbsp;Provide accurate specialist advice, guidance and reporting on functional responsibilities.<br>• &nbsp; &nbsp;Make and communicate decisions using good judgement, expertise and knowledge, governed by legislation, regulations, best practice principles or relevant operating instructions and procedures. &nbsp;<br></p><p><br></p><p>* Please quote us the overall amount for this work including GST.&nbsp;</p>","data":[{"label":"Estimated start date","value":"Wednesday, 15 March 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Experience with performing Cyber Security risk assessments and Penetration testing in Federal Government Setting.","weight":"40 %"},{"desc":"Value for money","weight":"30 %"},{"desc":"Experience with the PSPF and ISM","weight":"20 %"},{"desc":"Experience with performing risk assessments and producing Quality Documents Like SSP, SRMP and SOA that are IRAP Ready in the government Setting.","weight":"10 %"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","case study","resumés","references"]}},{"title":"Renewal iApply Licence Subscription with DWS","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=194b79e71b152d10072a98eb274bcb43&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nRenewal iApply Licence Subscription with DWS ID: DM-17894\nAustralian Securities and Investments Commission\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: Software Engineering and Development\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17894"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Australian Securities and Investments Commission"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>The current iApply solution subscription and support services commenced on the 21 May 2020 and expires on the 20 May 2023.&nbsp;</p><p>DWS has provided enhancements, maintenance and support services for iApply during the current period.</p><p>ASIC seeks to renew the iApply software maintenance &amp; support license subscription to for a futher 12 or 24 months.</p><p>ASIC wishes to procure the iApply Silver Subscription Plan.</p><p>The iApply licensing will include the following items:<br>•Fully functional version of iApply<br>•Latest patches and product updates<br>•DWS Service Delivery Plan</p><p><br></p><p>Please provide a quote for 12 months &amp; 24 months&nbsp;</p>","data":[{"label":"Estimated start date","value":"Sunday, 21 May 2023"},{"label":"Initial contract duration","value":"12 months or 24 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"As per description"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal"]}},{"title":"Business Architect","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=303d3ea387152d10573d450a0cbb359e&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nBusiness Architect ID: DM-17906\nAustralian Transaction Reports and Analysis Centre\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17906"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 09 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Transaction Reports and Analysis Centre"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<table width=\"0\" class=\"mce-item-table\"><tbody><tr><td width=\"677\"><p>A short term contract for a Business Architect for the Secure Sharing Platform is required to work collaboratively as a part of an agile project team, as well as responding to the needs of the ITS Branch, the Fintel Alliance Operations Hub, the International Team and a range of external stakeholders, in particular the Department of Finance, to contribute to delivering a solution that addresses a range of strategic priorities.&nbsp;</p><p>The Business Architect, will be required to:</p><ul><li>Undertake a holistic, multidimensional business view of the capabilities, end‐to‐end value delivery, information, and organisational structure of the Secure Sharing platform;&nbsp;</li><li>Develop product roadmaps and blueprints and continually monitor them against project deliverables;</li><li>Build and document business views and strategies, products, policies, initiatives, and stakeholders;</li><li>Identify, document and validate the current and future-state business processes, contributing to the development of business knowledge and definition of current and future state process maps, systems interfaces, business scenarios, data enhancements and use cases;</li><li>Analyse, map risks and propose solutions or alternatives and clearly articulate solutions to resolve complex business issues;</li><li>Engage with internal and external stakeholders to support project outcomes; and</li><li>Navigate difficult problems and work autonomously on tasks with complexity.</li></ul><p>The Business Architect will need excellent communication and interpersonal skills with the ability to influence outcomes at all levels of the business to deliver business outcome</p><p><br></p></td></tr></tbody></table>","data":[{"label":"Estimated start date","value":"Wednesday, 12 April 2023"},{"label":"Initial contract duration","value":"40 weeks"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT, NSW"},{"label":"Working arrangements","value":"Working five days a week capped at 10 hours per week."},{"label":"Security clearance","value":"Must have Negative Vetting Level 1"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Extent to which the response meets AUSTRAC’s requirement set out in the RFQ.","weight":"50 %"},{"desc":"The Supplier’s demonstrated capability and capacity to provide the requirement.","weight":"50 %"}],"desirable":[{"desc":"Whole of life costs incurred by AUSTRAC. Considerations will include both the quotes price and any costs AUSTRAC will incur as a result of accepting the Supplier’s response."}]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"1949-2022-23 MS Teams Calling","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=8b5b9aeb1b59a910796b0edbdc4bcbd2&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\n1949-2022-23 MS Teams Calling ID: DM-17901\nBureau of Meteorology\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: Agile Delivery and Governance(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17901"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 10 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Bureau of Meteorology"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Introducing MS Teams Calling to provide the Bureau inbound/outbound call functionality within MS Teams and to replace End of Life Cisco Mall Manager. This procurement is to engage with a Microsoft partner to deploy MS Teams Calling.</p>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"VIC, Offsite"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Our goal with this project is to identify a single platform that provides: • Team communication through chat, meetings & calls. • PSTN Calling in a cloud solution. • End-users the capability to securely configure calling in their soft client and/or via a user portal. • The ability to eliminate or greatly reduce reliance on traditional PBX systems and on-premises hardware. • A single UI to streamline deployment, configuration, and management. • A solution that scales globally. • Call / Contact Centre capabilities. • Integrating with existing call recording software. • Full delivery is to be finalised by 30th June 2023"}],"desirable":[]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","response template"]}},{"title":"Migration of N Library to IBSS","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=733e87121b5da51035320edbdc4bcb18&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nMigration of N Library to IBSS ID: DM-17874\nDepartment of Defence\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: Support and Operations\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17874"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Wednesday, 08 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Department of Defence"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Please see attached document.</p>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"Respondents degree of overall compliance with the RFQ"},{"desc":"The extent to which the tendered solution is assessed as meeting the draft SOW"},{"desc":"The tendered prices and pricing structure, including any proposed payment schedule"}],"desirable":[{"desc":"Past performance of contractual obligations of the tenderer"}]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references"]}},{"title":"Temp Personnel - Senior Program Coordinator","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=4ca416a787912d10ca450e170cbb35d6&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nTemp Personnel - Senior Program Coordinator ID: DM-17899\nAustralian Maritime Safety Authority\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17899"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 09 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Maritime Safety Authority"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Submit Resumes as per the attached PD, no selection criteria required</p><p>Interviews held w/c Monday 20 March 2023.</p>","data":[{"label":"Estimated start date","value":"Tuesday, 11 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The successful candidate will be expected to work in accordance with the COVID Safe Plan of AMSA, and the flexible working arrangements agreed with the manager. This requires working at least three days per week in the office (82 Northbourne Avenue, Braddon)."},{"label":"Security clearance","value":"Not required"},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated success working in a tight-knit agile project team engaged in providing data capabilities and services to technical and business stakeholders.","weight":"30 %"},{"desc":"Demonstrated experience in planning, managing, and executing ICT/Data projects using agile methodology, and/or demonstrated ability to develop business cases for ICT/Data projects.","weight":"30 %"},{"desc":"Excellent interpersonal skills with the ability to develop strong client relationships and translate business requirements to technology solutions.","weight":"20 %"},{"desc":"Demonstrated ability to deliver business solutions within agreed time, cost, and quality expectations.","weight":"20 %"}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"2024-2022-23 Web Support Developer","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=620cfd1b8751e910ca450e170cbb3571&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\n2024-2022-23 Web Support Developer ID: DM-17886\nBureau of Meteorology\nClosing: 14 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17886"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 10 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Bureau of Meteorology"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>A Web Support Developer is required to join the ROBUST Program, sitting in the Data and Digital Group (DDG), Digital Channels &amp; Customer Experience Design support team. The candidate will be the dedicated resource for the Incremental Decommissioning Website Project, with experience in working on digital platforms and will be responsible for decommissioning of allocated web pages.&nbsp;</p><p>The developer will work closely with ROBUST Project team including project manager and business analyst as well as the Digital Channels &amp; Customer Experience Design support team.&nbsp; Market Briefing to be held for this opportunity. Please refer to Request for Quotation for details of date/time. Select agencies invited to participate in this opportunity. No further invitations will be extended to additional agencies.&nbsp;</p>","data":[{"label":"Estimated start date","value":"Monday, 03 April 2023"},{"label":"Initial contract duration","value":"14 Months"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"2"},{"label":"Location of work","value":"VIC"},{"label":"Working arrangements","value":"Three days in the office with two days working remotely."},{"label":"Security clearance","value":"Other - At commencement, the candidate must: 1. be eligible to obtain and maintain Baseline Security Clearance at a minimum and NV1 Security Clearance where required by the Bureau, or 2. have an up to date police check with no qualifications or disclosable outcomes. To be eligible to obtain a Security Clearance, candidates are required to meet certain pre-screening requirements, including the requirement that the candidate provide evidence of Australian citizenship. Further information can be obtained from http://defence.gov.au/AGSVA/."},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Refer to Statement of Requirements"}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","interview"]}},{"title":"Temp Personnel – Project Coordinator","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=d6db82eb87512d10ca450e170cbb355a&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nTemp Personnel – Project Coordinator ID: DM-17896\nAustralian Maritime Safety Authority\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17896"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 09 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Maritime Safety Authority"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Submit Resumes as per the attached PD, no selection criteria required</p><p>Interviews held w/c Monday 20 March 2023.</p>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"12 months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The successful candidate will be expected to work in accordance with the COVID Safe Plan of AMSA, and the flexible working arrangements agreed with the manager. This requires working at least three days per week in the office (82 Northbourne Avenue, Braddon)."},{"label":"Security clearance","value":"Not required"},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated success working in a tight-knit agile project team engaged in providing data capabilities and services to technical and business stakeholders.","weight":"30 %"},{"desc":"Demonstrated experience in planning, managing, and executing ICT/Data projects using agile methodology, and/or demonstrated ability to develop business cases for ICT/Data projects.","weight":"30 %"},{"desc":"Excellent interpersonal skills with the ability to develop strong client relationships and translate business requirements to technology solutions.","weight":"20 %"},{"desc":"Demonstrated ability to deliver business solutions within agreed time, cost, and quality expectations.","weight":"20 %"}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"ICT Test Analyst x 3","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=39d9431d1b596510472c1f8c274bcb6f&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nICT Test Analyst x 3 ID: DM-17833\nAustralian Electoral Commission\nClosing: 14 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17833"},{"label":"RFQ published date","value":"Tuesday, 07 March 2023"},{"label":"Deadline for asking questions","value":"Friday, 10 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Electoral Commission"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Please refer to the attached requirements document. Please note that the responsibilities and required skills will be the same for all three ICT Test Analyst positions.</p>","data":[{"label":"Estimated start date","value":"Tuesday, 28 March 2023"},{"label":"Initial contract duration","value":"ASAP to 31 December 2023"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"It is AEC's preference that these roles be performed from National Office in Canberra."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Please refer to the attached Submission document."}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"1408a-2022-23 Senior Communications Advisor","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=0d82f2531b59691035320edbdc4bcb2e&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\n1408a-2022-23 Senior Communications Advisor ID: DM-17891\nBureau of Meteorology\nClosing: 15 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17891"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 14 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Bureau of Meteorology"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>As the Senior Communications Advisor, External Communications, you will lead the delivery of a strategic, planned communications approach that tells the Bureau story to build our reputation as the trusted source of information.</p><p>At the heart of this role is strategic communications. You will demonstrate a proven ability to problem-solve and develop communication and issues management strategies underpinned by clear logic, considered thinking and a solid evidence-base. You will deliver a coordinated, consistent and collaborative approach to informing internal and external stakeholders about the Bureau's work.</p><p>Working across the Communications Program, you will develop and deliver communications strategies that support the work being undertaken by business area. You will provide strategic communication advice to support operational areas, aligned to priorities. You will develop and coordinate internal and external communication activities across a range of platforms and channels and ensure alignment with the organisation's overall strategic direction.</p><p>Our work has a significant impact on the lives of many Australians. This is a role where you will feel like you are making a direct contribution to the Australian community by keeping them informed and engaged about the weather, climate, water and oceans.</p><p><br></p><p>Please refer to attached RFQ documents</p><p style=\"margin: 0in; font-family: Calibri; font-size: 11.0pt;\"><span style=\"font-size: 12pt;\"><strong><span style=\"background: white;\">***The Bureau is not accepting invitation of inclusion, as this approach has been made to a select number of agencies and no further invitations are accepted.</span></strong></span></p>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"3 months"},{"label":"Extension term","value":"3 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, QLD, VIC"},{"label":"Working arrangements","value":"This is a full time position with the expectation of 3 days in the office and 2 days WFH until advised otherwise"},{"label":"Security clearance","value":"Other - At commencement, the candidate must: 1. be eligible to obtain and maintain Baseline Security Clearance at a minimum and NV1 Security Clearance where required by the Bureau, and 2. have an up to date police check with no qualifications or disclosable outcomes. To be eligible to obtain a Security Clearance, candidates are required to meet certain pre-screening requirements, including the requirement that the candidate provide evidence of Australian citizenship. Further information can be obtained from http://defence.gov.au/AGSVA/."},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Please refer to RFQ documents"}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","interview"]}},{"title":"Full stack software engineers (Multiple)","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=78179697871da910f1afc9150cbb3564&entry=opp_page","type":"Open to all","innerText":"Open to all\nFull stack software engineers (Multiple) ID: DM-17889\nDepartment of Education, Skills and Employment\nClosing: 20 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17889"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Wednesday, 15 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 20 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Department of Education, Skills and Employment"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Do you enjoy working in a team developing with latest technology whilst also building products that make a difference? Then this job could be for you.</p><p><br></p><p><strong>You will be a great fit for this role if:</strong></p><ul><li>You have demonstrated experience developing web applications with modern reactive JavaScript frameworks.</li><li>You have backend development using web API and SQL technologies.</li><li>A solid understanding of software development principles using any language or toolset but preferably C#, Vue and TypeScript.</li><li>Automation of builds, tests and deployments.</li><li>Independence, motivation and timely production of high-quality work.</li><li>Solid communication between you and your team.</li><li>A collaborative, problem solving attitude.</li><li>Passion, pragmatism and empathy.</li></ul><p><br></p><p><strong>Responsibilities:</strong></p><ul><li>Participate in requirements analysis</li><li>Collaborate with internal teams to produce software design and architecture</li><li>Write clean, maintainable and scalable code following Departmental standards and practices</li><li>Work collaboratively with team members</li><li>Test and deploy applications and systems</li><li>Revise, update, refactor and debug code</li><li>Improve and maintain existing software</li><li>Develop documentation throughout the software development life cycle (SDLC)</li><li>Serve as an expert on applications and provide technical support</li></ul><p><br></p><p><strong>What you'll get from us</strong></p><p><strong><br></strong></p><p>Join us and you'll be working with the latest technology to build products that make a difference.</p><p>You'll also get to work in a fun, collaborative and productive team.</p><p>You’ll be supported in your exploration of new ideas and novel ways to deliver our broad scope of work.</p><p><br></p><p><strong>***Please note we have included a new submission guide which must be completed and attached to your submission. Failure to complete this guide will result in disqualifying your submission***</strong></p>","data":[{"label":"Estimated start date","value":"Monday, 20 March 2023"},{"label":"Initial contract duration","value":"Until 30 June 2024"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Full Time Requirement: Onsite, standard 8 hours per day, and 40 hours per week in total. Flexible Working Arrangements (including remote working arrangements): Requests will be considered on a case-by-case basis against the business requirements of the department and the needs of the immediate work area. Reduced Activity Period - A reduced activity period may apply where the specified personnel will not work unless the buyer has provided pre-approval in writing, which includes: • public holidays; and • Christmas shutdown, from 12:30 pm on the last working day before Christmas Day and reopening the first working day following the first day of January each year."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Experience developing and delivering public facing web applications utilising established development tools, guidelines and conventions including the following technologies: • ASP.NET MVC / .NET Core • JavaScript / Typescript • Reactive frontend frameworks including React, Vue or Angular • CSS frameworks including Bootstrap • Microsoft Web API / REST Architecture • SQL / Entity Framework"}],"desirable":[{"desc":"• CI/CD Practices • Experience with PowerShell automation • Experience with concurrent development source control (Git) • Solution Design Patterns and Best Practices, e.g. SOA • Unit / Automated UI testing • Understanding of Software Development Life Cycle and Agile methodologies."}]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Temp Personnel - Change Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=eb6d06df8715ad105b220ed90cbb35c1&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nTemp Personnel - Change Manager ID: DM-17888\nAustralian Maritime Safety Authority\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17888"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 09 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Maritime Safety Authority"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Submit Resumes as per the attached PD, no selection criteria required</p><p>Interviews held w/c Monday 20 March 2023.</p>","data":[{"label":"Estimated start date","value":"Tuesday, 11 April 2023"},{"label":"Initial contract duration","value":"12 Months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The successful candidate will be expected to work in accordance with the COVID Safe Plan of AMSA, and the flexible working arrangements agreed with the manager. This requires working atleast three days per week in the office (82 Northbourne Avenue, Braddon)."},{"label":"Security clearance","value":"Not required"},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated success working in a tight-knit agile project team engaged in providing data capabilities and services to technical and business stakeholders.","weight":"30 %"},{"desc":"Demonstrated experience in planning, managing, and executing ICT/Data projects using agile methodology, and/or demonstrated ability to develop business cases for ICT/Data projects.","weight":"30 %"},{"desc":"Excellent interpersonal skills with the ability to develop strong client relationships and translate business requirements to technology solutions.","weight":"20 %"},{"desc":"Demonstrated ability to deliver business solutions within agreed time, cost, and quality expectations.","weight":"20 %"}],"desirable":[]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Temp Personnel - Program Specialist","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=fd238e138715ad105b220ed90cbb3504&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nTemp Personnel - Program Specialist ID: DM-17887\nAustralian Maritime Safety Authority\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17887"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Thursday, 09 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"Australian Maritime Safety Authority"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Submit Resumes as per the attached PD, no selection criteria required,&nbsp;</p><p>Interviews held w/c Monday 13 March 2023.</p>","data":[{"label":"Estimated start date","value":"Tuesday, 11 April 2023"},{"label":"Initial contract duration","value":"12 Months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"The successful candidate will be expected to work in accordance with the COVID Safe Plan of AMSA, and the flexible working arrangements agreed with the manager. This requires working atleast three days per week in the office (82 Northbourne Avenue, Braddon)."},{"label":"Security clearance","value":"Not required"},{"label":"Maximum number of candidates per seller","value":"3"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated success working in a tight-knit agile project team engaged in providing data capabilities and services to technical and business stakeholders.","weight":"30 %"},{"desc":"Demonstrated experience in planning, managing, and executing ICT/Data projects using agile methodology, and/or demonstrated ability to develop business cases for ICT/Data projects.","weight":"30 %"},{"desc":"Excellent interpersonal skills with the ability to develop strong client relationships and translate business requirements to technology solutions.","weight":"20 %"},{"desc":"Demonstrated ability to deliver business solutions within agreed time, cost, and quality expectations","weight":"20 %"}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references","interview"]}},{"title":"SharePoint Records Integration Specialist","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=5fea7d171b112d10472c1f8c274bcb34&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nSharePoint Records Integration Specialist ID: DM-17885\nComcare\nClosing: 13 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17885"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Tuesday, 07 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Monday, 13 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"Comcare"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>As per the Summary of Work&nbsp;</p>","data":[{"label":"Estimated start date","value":"Saturday, 01 April 2023"},{"label":"Initial contract duration","value":"March 2023 to August 2023"},{"label":"Extension term","value":"6 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, NSW, TAS, VIC"},{"label":"Working arrangements","value":"Comcare Employees are required to spend between 40 and 60 per cent of their working hours in the office as agreed with their manager. Equipment required to work from home remains the responsibility of the employee to source."},{"label":"Security clearance","value":"Must be able to obtain Baseline"},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum hourly rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Demonstrated ability to perform repetitive tasks, follow instructions and work as part of a team to deliver project deliverables for Information Management.","weight":"25 %"},{"desc":"Demonstrated ability to perform repetitive tasks, follow instructions and work as part of a team to deliver project deliverables for Information Management.","weight":"25 %"},{"desc":"Experience with document extraction in Content Manager 9 or Records Manager 8; and experience with navigation and usage of SharePoint Online.","weight":"50 %"}],"desirable":[]},"submit":["start date","hourly rate","responses to selection criteria","resumés","references"]}},{"title":"APS6 Team Lead – PACE Support, Greenway ACT or Richmond VIC (108011)","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=5c07f19f1b996910796b0edbdc4bcb7b&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nAPS6 Team Lead – PACE Support, Greenway ACT or Richmond VIC (108011) ID: DM-17884\nNational Disability Insurance Agency\nClosing: 16 March 2023, 11:59PM Canberra time\nCategory: ICT Labour Hire\nView details ","details":{"overview":[{"label":"RFQ type","value":"ICT Labour Hire"},{"label":"RFQ ID","value":"DM-17884"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Thursday, 16 March 2023 • 11:59pm, Canberra time (or once all sellers have responded)"},{"label":"Buyer","value":"National Disability Insurance Agency"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<h3>Mandatory Requirement</h3><p>As part of the eligibility and suitability requirement, NDIA seeks specified personnel who are Australian citizens.</p><p>Applicable for ACT, VIC and QLD: Labour hire licences are required in the state that specified personnel are being contracted.</p><p>The request seeks to engage experienced sellers who have capability to provide an ICT Team Lead to support the agency’s Salesforce platform. As an ICT Team Lead, you will be responsible for leading a team of support specialists and managing day-to-day operations of the Salesforce system and the release management process. You will work closely with cross-functional teams to identify, troubleshoot and resolve Salesforce-related issues and provide continuous improvement to the platform.</p><p>Key Responsibilities:</p><ul><li>Manage a team of support specialists, providing coaching and support to ensure high-quality service delivery.</li><li>Manage and co-ordinate the backlog of incidents, bugs, change requests, and system enhancements across the breadth of the Salesforce platform.</li><li>Execute all required ICT change management activities including creation of high-quality change records and release documentation, coordination of testing activities, sign-offs from various stakeholders and more.</li><li>Develop and implement support processes and procedures to ensure consistent and efficient resolution of Salesforce-related issues.</li><li>Serve as a subject matter expert on the agency’s Salesforce platform and its business rules, staying up-to-date with new features and functionalities</li><li>Collaborate with cross-functional teams to identify and prioritize bug fixes, system enhancements and upgrades.</li><li>Perform operational tasks including access management and provisioning, backup and restore activities, internal reviews, control implementation and service transition activities.</li><li>Build and maintain relationships with key stakeholders to ensure business objectives are met.</li><li>Monitor and analyse system health and performance, identifying areas of improvement and implementing solutions, including improving the team’s ability to identify and respond to system issues before end users.</li><li>Develop various reporting including incident and queue management, team capacity and velocity, problem areas, trends, and business uptake.</li><li>Develop and maintain user documentation and training materials to ensure user adoption and satisfaction.</li></ul>","data":[{"label":"Estimated start date","value":"Monday, 17 April 2023"},{"label":"Initial contract duration","value":"12 Months"},{"label":"Extension term","value":"12 months"},{"label":"Number of extensions","value":"1"},{"label":"Location of work","value":"ACT, VIC"},{"label":"Working arrangements","value":"Subject to negotiations with line manager, hybrid working arrangements in line with current NDIS policy are available (minimum of 3 days each week in the office, with flexible arrangements in place for the remaining 2 days). Please refer to draft work order detailing changes to Clauses 27 & 28"},{"label":"Security clearance","value":"Other - Candidates must have, or be able to obtain an Australian Government Security Clearance NV1 Pre-engagement Checks will be undertaken by NDIA and commencement is subject to the Specified Personnel meeting the standard in relation to the Pre-Engagement Check requirements. The Contractor must comply with and ensure ongoing compliance with the Pre-Engagement Checks. NDIA seeks specified personnel who are Australian citizens."},{"label":"Maximum number of candidates per seller","value":"2"},{"label":"Maximum daily rate","value":"You must be logged in and have access to this marketplace to view this information."}]},"criteria":{"essential":[{"desc":"Experience of at least 3-5 years in managing IT support operations, including managing teams."},{"desc":"Experience working with cross-functional teams and managing stakeholder relationships, demonstrating excellent communication and interpersonal skills."},{"desc":"Experience in developing and implementing support processes and procedures."},{"desc":"Strong problem-solving skills and attention to detail."}],"desirable":[{"desc":"Experience working with the Atlassian suite, specifically Jira, Confluence and Service Desk."},{"desc":"Experience supporting business applications with complex business rules."},{"desc":"Strong understanding of the Salesforce platform and its functionalities."}]},"submit":["start date","daily rate","responses to selection criteria","resumés","references","interview"]}},{"title":"Change Manager","href":"https://www.buyict.gov.au/sp?id=opportunity_details&table=u_dmp_procurement&sys_id=7a79ed5387d1e910573d450a0cbb356b&entry=opp_page","type":"Invited sellers only","innerText":"Invited sellers only\nChange Manager ID: DM-17881\nICON WATER LIMITED\nClosing: 17 March 2023, 11:59PM Canberra time\nCategory: Change and Transformation(+ more)\nView details ","details":{"overview":[{"label":"RFQ type","value":"Professional Services and Consulting"},{"label":"RFQ ID","value":"DM-17881"},{"label":"RFQ published date","value":"Monday, 06 March 2023"},{"label":"Deadline for asking questions","value":"Monday, 13 March 2023 • 11:59pm, Canberra time"},{"label":"RFQ closing date","value":"Friday, 17 March 2023 • 11:59pm, Canberra time"},{"label":"Buyer","value":"ICON WATER LIMITED"},{"label":"Buyer contact","value":"No contact details reported. Please direct questions through the 'Question and Answers' portion of the RFQ process."}],"requirements":{"description":"<p>Icon Water is seeking an experienced Change Manger for its digital transformation program.</p><p>Working across multiple business areas (field based and office based), delivering change in a fast-changing environment, the Change Manager involves and collaborates with stakeholders to assesses the current state compared to the future state, and analyse the change impact to create a strategic communications and engagement approach that enables change across the organisation.</p><p><br></p>","data":[{"label":"Estimated start date","value":"Monday, 27 March 2023"},{"label":"Initial contract duration","value":"10 months"},{"label":"Extension term","value":"Not applicable"},{"label":"Location of work","value":"ACT"},{"label":"Working arrangements","value":"Buyer has not provided these details"}]},"criteria":{"essential":[{"desc":"• Extensive experience as a Change Manager or within a project/communications role • Tertiary qualifications in communications, change management, project management or related discipline • Exceptional written and verbal communication skills • Excellent active listening skills • Ability to translate complex information in simple messages to a variety of audiences • Ability to establish and maintain strong relationships • Able to deliver engagement strategies and communications and change plans • Ability to confidently conduct change impact analysis, and establish and maintain strong working relationships with stakeholders • Good business acumen and understanding of organisational issues and challenges • Able to manage multiple deliverables and schedules simultaneously"}],"desirable":[{"desc":"• Change management certification or designation desired"}]},"submit":["quote valid until date","breakdown of charges","detailed description of offerings","response to criteria","written proposal","resumés","references","interview"]}}]}